[Killed] StringLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:19:6
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/courses/allForInstructors"],
+    [""],
     { method: "GET", url: "/api/courses/allForInstructors" },
     // Stryker disable next-line all : don't test default value of empty list
killedBy: InstructorInstructorCoursesIndexPage tests Can submit new course
statusReason: expected undefined to be truthy

[Killed] ObjectLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:20:5
     status: _status,
   } = useBackend(
     ["/api/courses/allForInstructors"],
-    { method: "GET", url: "/api/courses/allForInstructors" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: InstructorInstructorCoursesIndexPage tests Renders course data correctly for admin user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Killed] ArrayDeclaration
main/pages/Courses/InstructorCoursesIndexPage.jsx:42:75
     setViewModal(false);
   };
 
-  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
-    "/api/courses/allForInstructors",
-  ]);
+  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
 
   const onSubmit = async (data) => {
killedBy: InstructorInstructorCoursesIndexPage tests useBackend and useBackendMutation are called with correct cache query key
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received:

  1st useBackendMutation call:

  [
-   Any<Function>,
