[Killed] StringLiteral
main/pages/Admin/AdminCoursesIndexPage.jsx:20:6
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/courses/allForAdmins"],
+    [""],
     { method: "GET", url: "/api/courses/allForAdmins" },
     // Stryker disable next-line all : don't test default value of empty list
killedBy: AdminCoursesIndexPage tests Can submit new course
statusReason: expected undefined to be truthy

[Killed] StringLiteral
main/pages/Admin/AdminCoursesIndexPage.jsx:21:15
     status: _status,
   } = useBackend(
     ["/api/courses/allForAdmins"],
-    { method: "GET", url: "/api/courses/allForAdmins" },
+    { method: "", url: "/api/courses/allForAdmins" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: AdminCoursesIndexPage tests renders empty table when backend unavailable, admin only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'
