[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:12:18
   },
   {
     header: "Course Name",
-    accessorKey: "courseName",
+    accessorKey: "",
   },
   {
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:30:4
   testId,
   isLoading,
   courseNameLinkPrefix,
-}) {
-  const columns = courseNameLinkPrefix
-    ? baseColumns.map((column) =>
-        column.accessorKey === "courseName"
-          ? {
-              ...column,
-              id: "courseName",
-              cell: ({ cell }) => (
-                <Link
-                  to={`${courseNameLinkPrefix}/${cell.row.original.id}`}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-                >
-                  {cell.row.original.courseName}
-                </Link>
-              ),
-            }
-          : column,
-      )
-    : baseColumns;
-
-  return <OurTable data={courses} columns={columns} testid={testId} />;
-}
+}) {}
 
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Courses/CoursesTable.jsx:32:23
   courseNameLinkPrefix,
 }) {
   const columns = courseNameLinkPrefix
-    ? baseColumns.map((column) =>
-        column.accessorKey === "courseName"
-          ? {
-              ...column,
-              id: "courseName",
-              cell: ({ cell }) => (
-                <Link
-                  to={`${courseNameLinkPrefix}/${cell.row.original.id}`}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-                >
-                  {cell.row.original.courseName}
-                </Link>
-              ),
-            }
-          : column,
+    ? baseColumns.map(() => undefined,
       )
     : baseColumns;
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] EqualityOperator
main/components/Courses/CoursesTable.jsx:33:9
 }) {
   const columns = courseNameLinkPrefix
     ? baseColumns.map((column) =>
-        column.accessorKey === "courseName"
+        column.accessorKey !== "courseName"
           ? {
               ...column,
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.jsx:34:13
   const columns = courseNameLinkPrefix
     ? baseColumns.map((column) =>
         column.accessorKey === "courseName"
-          ? {
-              ...column,
-              id: "courseName",
-              cell: ({ cell }) => (
-                <Link
-                  to={`${courseNameLinkPrefix}/${cell.row.original.id}`}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-                >
-                  {cell.row.original.courseName}
-                </Link>
-              ),
-            }
+          ? {}
           : column,
       )
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:36:19
         column.accessorKey === "courseName"
           ? {
               ...column,
-              id: "courseName",
+              id: "",
               cell: ({ cell }) => (
                 <Link
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Courses/CoursesTable.jsx:37:21
           ? {
               ...column,
               id: "courseName",
-              cell: ({ cell }) => (
-                <Link
-                  to={`${courseNameLinkPrefix}/${cell.row.original.id}`}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-                >
-                  {cell.row.original.courseName}
-                </Link>
-              ),
+              cell: () => undefined,
             }
           : column,
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 8
Received:
