[Killed] StringLiteral
main/pages/Admin/AdminCoursesIndexPage.jsx:20:6
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/courses/list/admins"],
+    [""],
     { method: "GET", url: "/api/courses/list/admins" },
     // Stryker disable next-line all : don't test default value of empty list
killedBy: AdminCoursesIndexPage tests Can submit new course
statusReason: expected undefined to be truthy

[Killed] StringLiteral
main/pages/Admin/AdminCoursesIndexPage.jsx:21:15
     status: _status,
   } = useBackend(
     ["/api/courses/list/admins"],
-    { method: "GET", url: "/api/courses/list/admins" },
+    { method: "", url: "/api/courses/list/admins" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: AdminCoursesIndexPage tests renders empty table when backend unavailable, admin only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Survived] BooleanLiteral
main/pages/Admin/AdminCoursesIndexPage.jsx:74:35
           testId="AdminCoursesTable"
           courses={courses}
           currentUser={currentUser}
-          enableInstructorUpdate={true}
+          enableInstructorUpdate={false}
           deleteCourseButton={true}
         />

[Killed] BooleanLiteral
main/pages/Admin/AdminCoursesIndexPage.jsx:75:31
           courses={courses}
           currentUser={currentUser}
           enableInstructorUpdate={true}
-          deleteCourseButton={true}
+          deleteCourseButton={false}
         />
       </div>
killedBy: AdminCoursesIndexPage tests Delete column does appear when deleteCourseButton is true
statusReason: Unable to find an element by: [data-testid="AdminCoursesTable-header-delete-sort-header"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
