[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:24:5
   canEditCourse,
   mutationQueryKeys = [
     "/api/courses/allForAdmins",
-    "/api/courses/allForInstructors",
+    "",
   ],
 }) {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Instructor update mutation uses correct cache keys for invalidation
statusReason: expected "invalidateQueries" to be called with arguments: [ Array(1) ]

Received:

  1st invalidateQueries call:

  [
    {

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:73:27
     {
       header: "Course Name",
       id: "courseName",
-      cell: ({ cell }) => {
-        return (
-          <OverlayTrigger
-            placement="right"
-            overlay={
-              <Tooltip id={`tooltip-coursename-${cell.row.index}`}>
-                View course details
-              </Tooltip>
-            }
-          >
-            <Link
-              to={`${courseNameLinkPrefix}/${cell.row.original.id}`}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-            >
-              {cell.row.original.courseName}
-            </Link>
-          </OverlayTrigger>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 8
Received:

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:85:28
           >
             <Link
               to={`${courseNameLinkPrefix}/${cell.row.original.id}`}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
+              data-testid={``}
             >
               {cell.row.original.courseName}
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:107:13
       id: "edit",
       cell: ({ cell }) => {
         const canEditCourse = canEdit(cell.row);
-        if (canEditCourse) {
+        if (false) {
           return (
             <Button
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:138:12
   ];
   const cellToAxiosParamsEdit = (formData) => {
     return {
-      url: `/api/courses/updateInstructor`,
+      url: ``,
       method: "PUT",
       params: {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful API call and dismisses modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] ObjectLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:163:13
   const cellToAxiosParamsDelete = (course) => ({
     url: "/api/courses",
     method: "DELETE",
-    params: {
-      courseId: course.id,
-    },
+    params: {},
   });
 
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Clicking the enabled delete button calls the correct axios DELETE request
statusReason: expected {} to deeply equal { courseId: 3 }

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:177:16
       toast(
         `Was not able to update instructor:\n${error.response.data.message}`,
       );
-    else toast(`Was not able to update instructor:\n${error.message}`);
+    else toast(``);
   };
 
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Shows alert when API call fails with 400 error without message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Was not able to update instructor:

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:182:11
 
   const onCourseUpdateSuccess = () => {
     handleCloseCourseEditModal();
-    toast("Course updated successfully");
+    toast("");
   };
 
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course updated successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Course updated successfully",

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:265:52
               variant="link"
               onClick={() => handleShowModal(cell.row.original)}
               data-testid={`${testId}-cell-row-${cell.row.index}-col-instructorEmail-button`}
-              style={{ padding: 0, textDecoration: "underline" }}
+              style={{ padding: 0, textDecoration: "" }}
             >
               {cell.row.original.instructorEmail}
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Tests styling of instructor email button for admins
statusReason: expect(element).toHaveStyle()

- Expected

  padding: 0px;
- textDecoration: underline;

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:282:17
             id: "delete",
             cell: ({ cell }) => {
               const canDelete =
-                cell.row.original.numStudents === 0 &&
+                true &&
                 cell.row.original.numStaff === 0;
 
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests Delete button is disabled when only one of numStudents or numStaff is zero
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-danger btn-sm"
  data-testid="InstructorAdminCoursesTable-cell-row-1-col-delete-button"
  type="button"
/>

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:293:19
               };
               // Stryker restore ObjectLiteral,StringLiteral
 
-              if (!canDelete) {
+              if (false) {
                 return (
                   <OverlayTrigger
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests Delete button is enabled only when course has no students or staff
statusReason: expected +0 to be 2 // Object.is equality
