[Killed] ArrayDeclaration
main/pages/Home/HomePageLoggedIn.jsx:20:5
     error: _staffError,
     status: _staffStatus,
   } = useBackend(
-    ["/api/courses/staffCourses"],
+    [],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET.
     { method: "GET", url: "/api/courses/staffCourses" },
killedBy: HomePageLoggedIn tests useBackend and useBackendMutation are called with correct cache query key
statusReason: expected 1st "useBackend" call to have been called with [ …(3) ]

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:60:5
   };
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
-    "/api/courses/allForInstructors",
+    "",
   ]);
 
killedBy: HomePageLoggedIn tests useBackend and useBackendMutation are called with correct cache query key
statusReason: expected 1st "useBackendMutation" call to have been called with [ Any<Function>, …(2) ]

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:93:14
                 No instructor courses yet. Click the button above to create one.
               </p>
             )}
-            {instructorCourses.length > 0 && (
-              <>
-                <>
-                  <InstructorAdminCoursesTable
-                    courses={instructorCourses}
-                    currentUser={currentUser}
-                  />
-                </>
-              </>
-            )}
+            {instructorCourses.length > 0 || <>
+                <>
+                  <InstructorAdminCoursesTable courses={instructorCourses} currentUser={currentUser} />
+                </>
+              </>}
           </>
         )}
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:109:10
         <StudentCoursesTable testid={"CoursesTable"} />
         <h1>Your Staff Courses</h1>
         {staffCourses.length === 0 && <p>No staff courses yet.</p>}
-        {staffCourses.length > 0 && (
-          <CoursesTable
-            courses={staffCourses}
-            testId={"StaffCoursesTable"}
-            courseNameLinkPrefix="/staff/courses"
-          />
-        )}
+        {staffCourses.length > 0 || <CoursesTable courses={staffCourses} testId={"StaffCoursesTable"} courseNameLinkPrefix="/staff/courses" />}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:109:10
         <StudentCoursesTable testid={"CoursesTable"} />
         <h1>Your Staff Courses</h1>
         {staffCourses.length === 0 && <p>No staff courses yet.</p>}
-        {staffCourses.length > 0 && (
-          <CoursesTable
-            courses={staffCourses}
-            testId={"StaffCoursesTable"}
-            courseNameLinkPrefix="/staff/courses"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >
