[Survived] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:17:15
 
 export default function InstructorAdminCoursesTable({
   courses,
-  storybook = false,
+  storybook = true,
   currentUser,
   testId = "InstructorAdminCoursesTable",

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:19:12
   courses,
   storybook = false,
   currentUser,
-  testId = "InstructorAdminCoursesTable",
+  testId = "",
   enableInstructorUpdate = false,
   deleteCourseButton = false,
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-header-edit-sort-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:20:28
   storybook = false,
   currentUser,
   testId = "InstructorAdminCoursesTable",
-  enableInstructorUpdate = false,
+  enableInstructorUpdate = true,
   deleteCourseButton = false,
   courseNameLinkPrefix = "/course",
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Tests instructor email is plain text for admin users when enableInstructorUpdate not selected
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-link"
  data-testid="InstructorAdminCoursesTable-cell-row-0-col-instructorEmail-button"
  style="padding: 0px; text-decoration: underline;"
  type="button"
>

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:21:24
   currentUser,
   testId = "InstructorAdminCoursesTable",
   enableInstructorUpdate = false,
-  deleteCourseButton = false,
+  deleteCourseButton = true,
   courseNameLinkPrefix = "/course",
   canEditCourse,
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests No Delete column or buttons are shown when default deleteCourseButton=false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="InstructorAdminCoursesTable-header-delete-sort-header"
>
  Delete
  <span
    data-testid="InstructorAdminCoursesTable-header-delete-sort-carets"

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:25:5
   courseNameLinkPrefix = "/course",
   canEditCourse,
   mutationQueryKeys = [
-    "/api/courses/list/admins",
+    "",
     "/api/courses/list/instructors",
   ],
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Instructor update mutation uses correct cache keys for invalidation
statusReason: expected "invalidateQueries" to be called with arguments: [ Array(1) ]

Received:

  1st invalidateQueries call:

  [
    {

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:31:28
 }) {
   const location = useLocation();
 
-  const canEdit = (row) => {
-    if (canEditCourse !== undefined) {
-      return typeof canEditCourse === "function"
-        ? canEditCourse(row)
-        : canEditCourse;
-    }
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
-    }
-    if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.original.instructorEmail === currentUser.root.user.email
-    ) {
-      return true;
-    }
-
-    return false;
-  };
+  const canEdit = (row) => {};
 
   const [showModal, setShowModal] = useState(false);
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:32:9
   const location = useLocation();
 
   const canEdit = (row) => {
-    if (canEditCourse !== undefined) {
+    if (true) {
       return typeof canEditCourse === "function"
         ? canEditCourse(row)
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:32:9
   const location = useLocation();
 
   const canEdit = (row) => {
-    if (canEditCourse !== undefined) {
+    if (false) {
       return typeof canEditCourse === "function"
         ? canEditCourse(row)
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests supports permission override props
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:33:14
 
   const canEdit = (row) => {
     if (canEditCourse !== undefined) {
-      return typeof canEditCourse === "function"
+      return true
         ? canEditCourse(row)
         : canEditCourse;
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests supports permission override props
statusReason: canEditCourse is not a function

[Killed] EqualityOperator
main/components/Courses/InstructorAdminCoursesTable.jsx:33:14
 
   const canEdit = (row) => {
     if (canEditCourse !== undefined) {
-      return typeof canEditCourse === "function"
+      return typeof canEditCourse !== "function"
         ? canEditCourse(row)
         : canEditCourse;
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests supports permission override props
statusReason: canEditCourse is not a function

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:37:9
         ? canEditCourse(row)
         : canEditCourse;
     }
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
+    if (true) {
       return true;
     }
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-1-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:37:9
         ? canEditCourse(row)
         : canEditCourse;
     }
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
+    if (false) {
       return true;
     }
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:38:14
         : canEditCourse;
     }
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
+      return false;
     }
     if (
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:41:7
       return true;
     }
     if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.original.instructorEmail === currentUser.root.user.email
+      false
     ) {
       return true;
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] LogicalOperator
main/components/Courses/InstructorAdminCoursesTable.jsx:41:7
       return true;
     }
     if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.original.instructorEmail === currentUser.root.user.email
+      hasRole(currentUser, "ROLE_INSTRUCTOR") || row.original.instructorEmail === currentUser.root.user.email
     ) {
       return true;
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-1-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:42:7
     }
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.original.instructorEmail === currentUser.root.user.email
+      true
     ) {
       return true;
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-1-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] EqualityOperator
main/components/Courses/InstructorAdminCoursesTable.jsx:42:7
     }
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.original.instructorEmail === currentUser.root.user.email
+      row.original.instructorEmail !== currentUser.root.user.email
     ) {
       return true;
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:43:7
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
       row.original.instructorEmail === currentUser.root.user.email
-    ) {
-      return true;
-    }
+    ) {}
 
     return false;
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:52:66
 
   const [showModal, setShowModal] = useState(false);
   const [selectedCourse, setSelectedCourse] = useState(null);
-  const [showCourseEditModal, setShowCourseEditModal] = useState(false);
+  const [showCourseEditModal, setShowCourseEditModal] = useState(true);
   const [selectedCourseForEdit, setSelectedCourseForEdit] = useState(null);
   const [showDeleteModal, setShowDeleteModal] = useState(false);
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Found multiple elements with the text: Course Name

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="InstructorAdminCoursesTable-header-courseName-sort-header"
>

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:54:58
   const [selectedCourse, setSelectedCourse] = useState(null);
   const [showCourseEditModal, setShowCourseEditModal] = useState(false);
   const [selectedCourseForEdit, setSelectedCourseForEdit] = useState(null);
-  const [showDeleteModal, setShowDeleteModal] = useState(false);
+  const [showDeleteModal, setShowDeleteModal] = useState(true);
   const [courseToDelete, setCourseToDelete] = useState(null);
 
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:57:49
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [courseToDelete, setCourseToDelete] = useState(null);
 
-  const handleShowCourseEditModal = (course) => {
-    setSelectedCourseForEdit(course);
-    setShowCourseEditModal(true);
-  };
+  const handleShowCourseEditModal = (course) => {};
 
   const handleCloseCourseEditModal = () => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Edit course modal opens and closes properly
statusReason: Unable to find an element by: [data-testid="CourseModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:59:28
 
   const handleShowCourseEditModal = (course) => {
     setSelectedCourseForEdit(course);
-    setShowCourseEditModal(true);
+    setShowCourseEditModal(false);
   };
 
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Edit course modal opens and closes properly
statusReason: Unable to find an element by: [data-testid="CourseModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:62:44
     setShowCourseEditModal(true);
   };
 
-  const handleCloseCourseEditModal = () => {
-    setShowCourseEditModal(false);
-    setSelectedCourseForEdit(null);
-  };
+  const handleCloseCourseEditModal = () => {};
 
   const columns = [
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="CourseModal-base"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:63:28
   };
 
   const handleCloseCourseEditModal = () => {
-    setShowCourseEditModal(false);
+    setShowCourseEditModal(true);
     setSelectedCourseForEdit(null);
   };
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="CourseModal-base"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:75:27
     {
       header: "Course Name",
       id: "courseName",
-      cell: ({ cell }) => {
-        return (
-          <LinkToScaffold
-            courseName={cell.row.original.courseName}
-            rowIndex={cell.row.index}
-            courseId={cell.row.original.id}
-            testId={`InstructorAdminCoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-          />
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 8
Received:

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:81:21
             courseName={cell.row.original.courseName}
             rowIndex={cell.row.index}
             courseId={cell.row.original.id}
-            testId={`InstructorAdminCoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
+            testId={``}
           />
         );
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:88:11
     },
     {
       header: "Settings",
-      id: "settings",
+      id: "",
       cell: ({ cell }) => {
         return (
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:89:27
     {
       header: "Settings",
       id: "settings",
-      cell: ({ cell }) => {
-        return (
-          <OverlayTrigger
-            placement="right"
-            overlay={
-              <Tooltip id={`tooltip-coursename-${cell.row.index}`}>
-                Settings and Course Roster for {cell.row.original.courseName}
-              </Tooltip>
-            }
-          >
-            <Link
-              to={`${courseNameLinkPrefix}/${cell.row.original.id}/settings`}
-              data-testid={`InstructorAdminCoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-            >
-              <UserListIcon />
-            </Link>
-          </OverlayTrigger>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-settings-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ObjectLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:109:5
         );
       },
     },
-    {
-      header: "Term",
-      accessorKey: "term",
-    },
+    {},
     {
       header: "School",
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:113:5
       header: "Term",
       accessorKey: "term",
     },
-    {
-      header: "School",
-      id: "school",
-      accessorKey: "school.displayName",
-    },
+    {},
     {
       header: "Edit",
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:115:11
     },
     {
       header: "School",
-      id: "school",
+      id: "",
       accessorKey: "school.displayName",
     },
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:116:20
     {
       header: "School",
       id: "school",
-      accessorKey: "school.displayName",
+      accessorKey: "",
     },
     {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  UCSB
Received:

[Killed] ObjectLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:118:5
       id: "school",
       accessorKey: "school.displayName",
     },
-    {
-      header: "Edit",
-      id: "edit",
-      cell: ({ cell }) => {
-        const canEditCourse = canEdit(cell.row);
-        if (canEditCourse) {
-          return (
-            <Button
-              variant="outline-primary"
-              size="sm"
-              onClick={() => handleShowCourseEditModal(cell.row.original)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
-            >
-              Edit
-            </Button>
-          );
-        } else {
-          return (
-            <span
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-no-permission`}
-            ></span>
-          );
-        }
-      },
-    },
+    {},
     {
       header: "Students",
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:119:15
       accessorKey: "school.displayName",
     },
     {
-      header: "Edit",
+      header: "",
       id: "edit",
       cell: ({ cell }) => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Edit
Received:

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:120:11
     },
     {
       header: "Edit",
-      id: "edit",
+      id: "",
       cell: ({ cell }) => {
         const canEditCourse = canEdit(cell.row);
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:121:27
     {
       header: "Edit",
       id: "edit",
-      cell: ({ cell }) => {
-        const canEditCourse = canEdit(cell.row);
-        if (canEditCourse) {
-          return (
-            <Button
-              variant="outline-primary"
-              size="sm"
-              onClick={() => handleShowCourseEditModal(cell.row.original)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
-            >
-              Edit
-            </Button>
-          );
-        } else {
-          return (
-            <span
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-no-permission`}
-            ></span>
-          );
-        }
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:123:13
       id: "edit",
       cell: ({ cell }) => {
         const canEditCourse = canEdit(cell.row);
-        if (canEditCourse) {
+        if (true) {
           return (
             <Button
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-1-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:123:28
       id: "edit",
       cell: ({ cell }) => {
         const canEditCourse = canEdit(cell.row);
-        if (canEditCourse) {
-          return (
-            <Button
-              variant="outline-primary"
-              size="sm"
-              onClick={() => handleShowCourseEditModal(cell.row.original)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
-            >
-              Edit
-            </Button>
-          );
-        } else {
+        if (canEditCourse) {} else {
           return (
             <span
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ArrowFunction
main/components/Courses/InstructorAdminCoursesTable.jsx:128:24
             <Button
               variant="outline-primary"
               size="sm"
-              onClick={() => handleShowCourseEditModal(cell.row.original)}
+              onClick={() => undefined}
               data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
             >
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Edit course modal opens and closes properly
statusReason: Unable to find an element by: [data-testid="CourseModal-base"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:134:16
               Edit
             </Button>
           );
-        } else {
-          return (
-            <span
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-no-permission`}
-            ></span>
-          );
-        }
+        } else {}
       },
     },
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-1-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:137:28
         } else {
           return (
             <span
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-no-permission`}
+              data-testid={``}
             ></span>
           );
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-1-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ObjectLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:143:5
         }
       },
     },
-    {
-      header: "Students",
-      accessorKey: "numStudents",
-    },
+    {},
     {
       header: "Staff",
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header
