[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:144:15
       },
     },
     {
-      header: "Students",
+      header: "",
       accessorKey: "numStudents",
     },
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: Students. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ObjectLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:147:5
       header: "Students",
       accessorKey: "numStudents",
     },
-    {
-      header: "Staff",
-      accessorKey: "numStaff",
-    },
+    {},
   ];
   const cellToAxiosParamsEdit = (formData) => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:148:15
       accessorKey: "numStudents",
     },
     {
-      header: "Staff",
+      header: "",
       accessorKey: "numStaff",
     },
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: Staff. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:149:20
     },
     {
       header: "Staff",
-      accessorKey: "numStaff",
+      accessorKey: "",
     },
   ];
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:152:47
       accessorKey: "numStaff",
     },
   ];
-  const cellToAxiosParamsEdit = (formData) => {
-    return {
-      url: `/api/courses/updateInstructor`,
-      method: "PUT",
-      params: {
-        courseId: formData.courseId,
-        instructorEmail: formData.instructorEmail,
-      },
-    };
-  };
+  const cellToAxiosParamsEdit = (formData) => {};
 
   const cellToAxiosParamsCourseEdit = (formData) => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful API call and dismisses modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] ObjectLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:156:15
     return {
       url: `/api/courses/updateInstructor`,
       method: "PUT",
-      params: {
-        courseId: formData.courseId,
-        instructorEmail: formData.instructorEmail,
-      },
+      params: {},
     };
   };
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful API call and dismisses modal
statusReason: expected {} to deeply equal { courseId: 1, …(1) }

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:163:53
     };
   };
 
-  const cellToAxiosParamsCourseEdit = (formData) => {
-    return {
-      url: `/api/courses`,
-      method: "PUT",
-      params: {
-        courseId: formData.courseId,
-        courseName: formData.courseName,
-        term: formData.term,
-        school: formData.school,
-      },
-    };
-  };
+  const cellToAxiosParamsCourseEdit = (formData) => {};
 
   const cellToAxiosParamsDelete = (course) => ({
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/Courses/InstructorAdminCoursesTable.jsx:176:35
     };
   };
 
-  const cellToAxiosParamsDelete = (course) => ({
-    url: "/api/courses",
-    method: "DELETE",
-    params: {
-      courseId: course.id,
-    },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const onInstructorUpdateSuccess = () => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Clicking the enabled delete button calls the correct axios DELETE request
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:177:10
   };
 
   const cellToAxiosParamsDelete = (course) => ({
-    url: "/api/courses",
+    url: "",
     method: "DELETE",
     params: {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Clicking the enabled delete button calls the correct axios DELETE request
statusReason: expected '' to be '/api/courses' // Object.is equality

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:184:43
     },
   });
 
-  const onInstructorUpdateSuccess = () => {
-    handleCloseModal();
-  };
+  const onInstructorUpdateSuccess = () => {};
 
   const onInstructorUpdateError = (error) => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful API call and dismisses modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:188:46
     handleCloseModal();
   };
 
-  const onInstructorUpdateError = (error) => {
-    if (error.response.data.message)
-      toast(
-        `Was not able to update instructor:\n${error.response.data.message}`,
-      );
-    else toast(`Was not able to update instructor:\n${error.message}`);
-  };
+  const onInstructorUpdateError = (error) => {};
 
   const onCourseUpdateSuccess = () => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Shows alert when API call fails with 400 error plus message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:189:9
   };
 
   const onInstructorUpdateError = (error) => {
-    if (error.response.data.message)
+    if (false)
       toast(
         `Was not able to update instructor:\n${error.response.data.message}`,
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Shows alert when API call fails with 400 error plus message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
    "Was not able to update instructor:

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:189:9
   };
 
   const onInstructorUpdateError = (error) => {
-    if (error.response.data.message)
+    if (true)
       toast(
         `Was not able to update instructor:\n${error.response.data.message}`,
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Shows alert when API call fails with 400 error without message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
    "Was not able to update instructor:

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:196:39
     else toast(`Was not able to update instructor:\n${error.message}`);
   };
 
-  const onCourseUpdateSuccess = () => {
-    handleCloseCourseEditModal();
-    toast("Course updated successfully");
-  };
+  const onCourseUpdateSuccess = () => {};
 
   const onCourseUpdateError = (error) => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course updated successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:201:42
     toast("Course updated successfully");
   };
 
-  const onCourseUpdateError = (error) => {
-    if (error.response.data.message)
-      toast(`Was not able to update course:\n${error.response.data.message}`);
-    else toast(`Was not able to update course:\n${error.message}`);
-  };
+  const onCourseUpdateError = (error) => {};
 
   const onDeleteSuccess = () => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Shows error toast when course update API call fails with message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:202:9
   };
 
   const onCourseUpdateError = (error) => {
-    if (error.response.data.message)
+    if (false)
       toast(`Was not able to update course:\n${error.response.data.message}`);
     else toast(`Was not able to update course:\n${error.message}`);
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Shows error toast when course update API call fails with message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
    "Was not able to update course:

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:202:9
   };
 
   const onCourseUpdateError = (error) => {
-    if (error.response.data.message)
+    if (true)
       toast(`Was not able to update course:\n${error.response.data.message}`);
     else toast(`Was not able to update course:\n${error.message}`);
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Shows error toast when course update API call fails without message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
    "Was not able to update course:

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:203:13
 
   const onCourseUpdateError = (error) => {
     if (error.response.data.message)
-      toast(`Was not able to update course:\n${error.response.data.message}`);
+      toast(``);
     else toast(`Was not able to update course:\n${error.message}`);
   };
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Shows error toast when course update API call fails with message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Was not able to update course:

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:207:33
     else toast(`Was not able to update course:\n${error.message}`);
   };
 
-  const onDeleteSuccess = () => {
-    toast("Course deleted successfully");
-    setShowDeleteModal(false);
-    setCourseToDelete(null);
-  };
+  const onDeleteSuccess = () => {};
 
   const onDeleteError = (error) => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Successful delete shows toast and closes modal
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course deleted successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:209:24
 
   const onDeleteSuccess = () => {
     toast("Course deleted successfully");
-    setShowDeleteModal(false);
+    setShowDeleteModal(true);
     setCourseToDelete(null);
   };
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Successful delete shows toast and closes modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Confirm Delete
</div> instead

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:213:36
     setCourseToDelete(null);
   };
 
-  const onDeleteError = (error) => {
-    // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    if (error.response?.data?.message)
-      toast(`Could not delete course:\n${error.response.data.message}`);
-    else toast(`Could not delete course:\n${error.message}`);
-  };
+  const onDeleteError = (error) => {};
 
   const editMutation = useBackendMutation(
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Shows error toast when delete course API call fails with message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:215:9
 
   const onDeleteError = (error) => {
     // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    if (error.response?.data?.message)
+    if (false)
       toast(`Could not delete course:\n${error.response.data.message}`);
     else toast(`Could not delete course:\n${error.message}`);
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Shows error toast when delete course API call fails with message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
    "Could not delete course:

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:215:9
 
   const onDeleteError = (error) => {
     // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    if (error.response?.data?.message)
+    if (true)
       toast(`Could not delete course:\n${error.response.data.message}`);
     else toast(`Could not delete course:\n${error.message}`);
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Shows fallback error toast when delete course API call fails without message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
    "Could not delete course:

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:247:39
     mutationQueryKeys,
   );
 
-  const handleShowModal = (course) => {
-    setSelectedCourse(course);
-    setShowModal(true);
-  };
+  const handleShowModal = (course) => {};
 
   const handleCloseModal = () => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Opens modal when admin clicks instructor email
statusReason: Unable to find role="dialog"

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:249:18
 
   const handleShowModal = (course) => {
     setSelectedCourse(course);
-    setShowModal(true);
+    setShowModal(false);
   };
 
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Opens modal when admin clicks instructor email
statusReason: Unable to find role="dialog"

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:252:34
     setShowModal(true);
   };
 
-  const handleCloseModal = () => {
-    setShowModal(false);
-    setSelectedCourse(null);
-  };
+  const handleCloseModal = () => {};
 
   const handleUpdateInstructor = async (formData) => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Modal closes when close button (X) is clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:253:18
   };
 
   const handleCloseModal = () => {
-    setShowModal(false);
+    setShowModal(true);
     setSelectedCourse(null);
   };
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Modal closes when close button (X) is clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:257:54
     setSelectedCourse(null);
   };
 
-  const handleUpdateInstructor = async (formData) => {
-    formData.courseId = selectedCourse.id;
-    editMutation.mutate(formData);
-  };
+  const handleUpdateInstructor = async (formData) => {};
 
   const handleUpdateCourse = async (formData) => {
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful API call and dismisses modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:262:50
     editMutation.mutate(formData);
   };
 
-  const handleUpdateCourse = async (formData) => {
-    formData.courseId = selectedCourseForEdit.id;
-    formData.school = formData.school.key;
-    courseEditMutation.mutate(formData);
-  };
+  const handleUpdateCourse = async (formData) => {};
 
   const columnsWithInstall = [
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:273:27
     {
       header: "Instructor",
       accessorKey: "instructorEmail",
-      cell: ({ cell }) => {
-        const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
-        if (isAdmin && enableInstructorUpdate) {
-          return (
-            <Button
-              variant="link"
-              onClick={() => handleShowModal(cell.row.original)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-instructorEmail-button`}
-              style={{ padding: 0, textDecoration: "underline" }}
-            >
-              {cell.row.original.instructorEmail}
-            </Button>
-          );
-        } else {
-          return cell.row.original.instructorEmail;
-        }
-      },
+      cell: ({ cell }) => {},
     },
     ...(deleteCourseButton
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  diba@ucsb.edu
Received:

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:275:13
       accessorKey: "instructorEmail",
       cell: ({ cell }) => {
         const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
-        if (isAdmin && enableInstructorUpdate) {
+        if (false) {
           return (
             <Button
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Tests instructor email is clickable for admin users when enableInstructorUpdate selected
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-instructorEmail-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:275:13
       accessorKey: "instructorEmail",
       cell: ({ cell }) => {
         const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
-        if (isAdmin && enableInstructorUpdate) {
+        if (true) {
           return (
             <Button
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Tests instructor email is plain text for admin users when enableInstructorUpdate not selected
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-link"
  data-testid="InstructorAdminCoursesTable-cell-row-0-col-instructorEmail-button"
  style="padding: 0px; text-decoration: underline;"
  type="button"
>

[Killed] ArrowFunction
main/components/Courses/InstructorAdminCoursesTable.jsx:279:24
           return (
             <Button
               variant="link"
-              onClick={() => handleShowModal(cell.row.original)}
+              onClick={() => undefined}
               data-testid={`${testId}-cell-row-${cell.row.index}-col-instructorEmail-button`}
               style={{ padding: 0, textDecoration: "underline" }}
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Opens modal when admin clicks instructor email
statusReason: Unable to find role="dialog"

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:286:16
               {cell.row.original.instructorEmail}
             </Button>
           );
-        } else {
-          return cell.row.original.instructorEmail;
-        }
+        } else {}
       },
     },
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  diba@ucsb.edu
Received:

[Killed] StringLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:294:21
     ...(deleteCourseButton
       ? [
           {
-            header: "Delete",
+            header: "",
             id: "delete",
             cell: ({ cell }) => {
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests Delete column appears only when deleteCourseButton=true
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Delete
Received:

[Killed] LogicalOperator
main/components/Courses/InstructorAdminCoursesTable.jsx:298:17
             id: "delete",
             cell: ({ cell }) => {
               const canDelete =
-                cell.row.original.numStudents === 0 &&
-                cell.row.original.numStaff === 0;
+                cell.row.original.numStudents === 0 || cell.row.original.numStaff === 0;
 
               // Stryker disable ObjectLiteral,StringLiteral : cosmetic styling for disabled button
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests Delete button is disabled when only one of numStudents or numStaff is zero
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-danger btn-sm"
  data-testid="InstructorAdminCoursesTable-cell-row-0-col-delete-button"
  type="button"
/>

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:298:17
             id: "delete",
             cell: ({ cell }) => {
               const canDelete =
-                cell.row.original.numStudents === 0 &&
-                cell.row.original.numStaff === 0;
+                true;
 
               // Stryker disable ObjectLiteral,StringLiteral : cosmetic styling for disabled button
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests Delete button is enabled only when course has no students or staff
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:299:17
             cell: ({ cell }) => {
               const canDelete =
                 cell.row.original.numStudents === 0 &&
-                cell.row.original.numStaff === 0;
+                true;
 
               // Stryker disable ObjectLiteral,StringLiteral : cosmetic styling for disabled button
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests Delete button is disabled when only one of numStudents or numStaff is zero
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-danger btn-sm"
  data-testid="InstructorAdminCoursesTable-cell-row-0-col-delete-button"
  type="button"
/>

[Killed] EqualityOperator
main/components/Courses/InstructorAdminCoursesTable.jsx:299:17
             cell: ({ cell }) => {
               const canDelete =
                 cell.row.original.numStudents === 0 &&
-                cell.row.original.numStaff === 0;
+                cell.row.original.numStaff !== 0;
 
               // Stryker disable ObjectLiteral,StringLiteral : cosmetic styling for disabled button
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests Delete button is enabled only when course has no students or staff
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:309:31
               };
               // Stryker restore ObjectLiteral,StringLiteral
 
-              if (!canDelete) {
-                return (
-                  <OverlayTrigger
-                    placement="right"
-                    overlay={
-                      <Tooltip>
-                        Cannot delete a course with active students or staff
-                      </Tooltip>
-                    }
-                  >
-                    <span className="d-inline-block">
-                      <div style={disabledButtonStyle}>
-                        <Button variant="light" size="sm" disabled>
-                          Delete
-                        </Button>
-                      </div>
-                    </span>
-                  </OverlayTrigger>
-                );
-              }
+              if (!canDelete) {}
 
               return (
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests Delete button is enabled only when course has no students or staff
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:309:19
               };
               // Stryker restore ObjectLiteral,StringLiteral
 
-              if (!canDelete) {
+              if (canDelete) {
                 return (
                   <OverlayTrigger
killedBy: InstructorAdminCoursesTable tests InstructorCourseTable delete course tests Delete button is enabled only when course has no students or staff
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
main/components/Courses/InstructorAdminCoursesTable.jsx:335:34
                   variant="danger"
                   size="sm"
                   data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
-                  onClick={() => {
-                    setCourseToDelete(cell.row.original);
-                    setShowDeleteModal(true);
-                  }}
+                  onClick={() => {}}
                 >
                   Delete
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Clicking the enabled delete button calls the correct axios DELETE request
statusReason: Unable to find role="button" and name "Yes, Delete"

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"
