[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:337:40
                   data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
                   onClick={() => {
                     setCourseToDelete(cell.row.original);
-                    setShowDeleteModal(true);
+                    setShowDeleteModal(false);
                   }}
                 >
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Clicking the enabled delete button calls the correct axios DELETE request
statusReason: Unable to find role="button" and name "Yes, Delete"

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorAdminCoursesTable"

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:355:19
         data-testid={`${testId}-modal`}
         show={showModal}
         onHide={handleCloseModal}
-        centered={true}
+        centered={false}
       >
         <Modal.Header closeButton>
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable update instructor modal tests Opens modal when admin clicks instructor email
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:379:42
       <Modal
         data-testid="InstructorAdminCoursesTable-delete-modal"
         show={showDeleteModal}
-        onHide={() => setShowDeleteModal(false)}
+        onHide={() => setShowDeleteModal(true)}
         centered
       >
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Delete modal closes when clicking the onHide handler
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Confirm Delete
</div> instead

[Killed] ArrowFunction
main/components/Courses/InstructorAdminCoursesTable.jsx:379:17
       <Modal
         data-testid="InstructorAdminCoursesTable-delete-modal"
         show={showDeleteModal}
-        onHide={() => setShowDeleteModal(false)}
+        onHide={() => undefined}
         centered
       >
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Delete modal closes when clicking the onHide handler
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Confirm Delete
</div> instead

[Killed] LogicalOperator
main/components/Courses/InstructorAdminCoursesTable.jsx:387:12
         </Modal.Header>
 
         <Modal.Body>
-          {courseToDelete && (
-            <p>
-              Please confirm that you really want to delete course{" "}
-              <strong>{courseToDelete.courseName}</strong>. This action cannot
-              be undone.
-            </p>
-          )}
+          {courseToDelete || <p>
+              Please confirm that you really want to delete course{" "}
+              <strong>{courseToDelete.courseName}</strong>. This action cannot
+              be undone.
+            </p>}
         </Modal.Body>
 
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Cannot read properties of null (reading 'courseName')

[Killed] ConditionalExpression
main/components/Courses/InstructorAdminCoursesTable.jsx:387:12
         </Modal.Header>
 
         <Modal.Body>
-          {courseToDelete && (
-            <p>
-              Please confirm that you really want to delete course{" "}
-              <strong>{courseToDelete.courseName}</strong>. This action cannot
-              be undone.
-            </p>
-          )}
+          {false}
         </Modal.Body>
 
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Delete modal opens when delete is clicked and closes when 'Do not delete' is clicked
statusReason: 
Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] BooleanLiteral
main/components/Courses/InstructorAdminCoursesTable.jsx:397:73
         </Modal.Body>
 
         <Modal.Footer>
-          <Button variant="secondary" onClick={() => setShowDeleteModal(false)}>
+          <Button variant="secondary" onClick={() => setShowDeleteModal(true)}>
             Do not delete
           </Button>
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Delete modal opens when delete is clicked and closes when 'Do not delete' is clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Confirm Delete
</div> instead

[Killed] ArrowFunction
main/components/Courses/InstructorAdminCoursesTable.jsx:397:48
         </Modal.Body>
 
         <Modal.Footer>
-          <Button variant="secondary" onClick={() => setShowDeleteModal(false)}>
+          <Button variant="secondary" onClick={() => undefined}>
             Do not delete
           </Button>
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Delete modal opens when delete is clicked and closes when 'Do not delete' is clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Confirm Delete
</div> instead

[Killed] ArrowFunction
main/components/Courses/InstructorAdminCoursesTable.jsx:403:22
 
           <Button
             variant="danger"
-            onClick={() => deleteMutation.mutate(courseToDelete)}
+            onClick={() => undefined}
           >
             Yes, Delete
killedBy: InstructorAdminCoursesTable tests InstructorAdminCoursesTable delete course API call tests Clicking the enabled delete button calls the correct axios DELETE request
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""
