[Killed] BlockStatement
main/components/Courses/StudentCoursesTable.jsx:5:49
 import CoursesTable from "main/components/Courses/CoursesTable";
 import React from "react";
 
-export function StudentCoursesTable({ testid }) {
-  const { data: courses } = useBackend(
-    ["/api/courses/list/students"],
-    // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
-    { method: "GET", url: "/api/courses/list/students" },
-    // Stryker disable next-line all : don't test default value of empty list
-    [],
-  );
-
-  return (
-    <>
-      {courses.length > 0 ? (
-        <>
-          <CoursesTable
-            courses={courses}
-            testId={testid}
-            courseNameLinkPrefix="/student/courses"
-          />
-        </>
-      ) : (
-        <p>You are not enrolled in any student courses yet.</p>
-      )}
-    </>
-  );
-}
+export function StudentCoursesTable({ testid }) {}
 
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] StringLiteral
main/components/Courses/StudentCoursesTable.jsx:7:6
 
 export function StudentCoursesTable({ testid }) {
   const { data: courses } = useBackend(
-    ["/api/courses/list/students"],
+    [""],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
     { method: "GET", url: "/api/courses/list/students" },

[Killed] ConditionalExpression
main/components/Courses/StudentCoursesTable.jsx:16:8
 
   return (
     <>
-      {courses.length > 0 ? (
+      {false ? (
         <>
           <CoursesTable
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      You are not enrolled in any student courses yet.
    </p>

[Killed] EqualityOperator
main/components/Courses/StudentCoursesTable.jsx:16:8
 
   return (
     <>
-      {courses.length > 0 ? (
+      {courses.length >= 0 ? (
         <>
           <CoursesTable
killedBy: StudentCoursesTable tests renders empty message when no courses
statusReason: Unable to find an element with the text: You are not enrolled in any student courses yet.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTab
