[Killed] StringLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:19:6
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/courses/list/instructors"],
+    [""],
     { method: "GET", url: "/api/courses/list/instructors" },
     // Stryker disable next-line all : don't test default value of empty list
killedBy: InstructorInstructorCoursesIndexPage tests Can submit new course
statusReason: expected undefined to be truthy

[Killed] ObjectLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:20:5
     status: _status,
   } = useBackend(
     ["/api/courses/list/instructors"],
-    { method: "GET", url: "/api/courses/list/instructors" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: InstructorInstructorCoursesIndexPage tests Renders course data correctly for admin user
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Killed] BooleanLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:25:52
     [],
   );
 
-  const [viewModal, setViewModal] = React.useState(false);
+  const [viewModal, setViewModal] = React.useState(true);
 
   const objectToAxiosParams = (course) => ({
killedBy: InstructorInstructorCoursesIndexPage tests renders empty table when backend unavailable, admin only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Killed] ArrowFunction
main/pages/Courses/InstructorCoursesIndexPage.jsx:27:31
 
   const [viewModal, setViewModal] = React.useState(false);
 
-  const objectToAxiosParams = (course) => ({
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      courseName: course.courseName,
-      term: course.term,
-      school: course.school,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: InstructorInstructorCoursesIndexPage tests Can submit new course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:27:44
 
   const [viewModal, setViewModal] = React.useState(false);
 
-  const objectToAxiosParams = (course) => ({
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      courseName: course.courseName,
-      term: course.term,
-      school: course.school,
-    },
-  });
+  const objectToAxiosParams = (course) => ({});
 
   const onSuccess = (course) => {
killedBy: InstructorInstructorCoursesIndexPage tests Can submit new course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/pages/Courses/InstructorCoursesIndexPage.jsx:37:33
     },
   });
 
-  const onSuccess = (course) => {
-    toast(`Course ${course.courseName} created`);
-    setViewModal(false);
-  };
+  const onSuccess = (course) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
killedBy: InstructorInstructorCoursesIndexPage tests Can submit new course
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="CourseModal-base"
>
  <div
    class="modal-content"

[Survived] StringLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:38:11
   });
 
   const onSuccess = (course) => {
-    toast(`Course ${course.courseName} created`);
+    toast(``);
     setViewModal(false);
   };

[Killed] BooleanLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:39:18
 
   const onSuccess = (course) => {
     toast(`Course ${course.courseName} created`);
-    setViewModal(false);
+    setViewModal(true);
   };
 
killedBy: InstructorInstructorCoursesIndexPage tests Can submit new course
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="CourseModal-base"
>
  <div
    class="modal-content"

[Killed] ArrayDeclaration
main/pages/Courses/InstructorCoursesIndexPage.jsx:42:75
     setViewModal(false);
   };
 
-  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
-    "/api/courses/list/instructors",
-  ]);
+  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
 
   const onSubmit = async (data) => {
killedBy: InstructorInstructorCoursesIndexPage tests useBackend and useBackendMutation are called with correct cache query key
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received:

  1st useBackendMutation call:

  [
-   Any<Function>,

[Killed] StringLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:43:5
   };
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
-    "/api/courses/list/instructors",
+    "",
   ]);
 
killedBy: InstructorInstructorCoursesIndexPage tests useBackend and useBackendMutation are called with correct cache query key
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received:

  1st useBackendMutation call:

  [
-   Any<Function>,

[Killed] BlockStatement
main/pages/Courses/InstructorCoursesIndexPage.jsx:46:36
     "/api/courses/list/instructors",
   ]);
 
-  const onSubmit = async (data) => {
-    data.school = data.school.key;
-    mutation.mutate(data);
-  };
+  const onSubmit = async (data) => {};
 
   const createCourse = () => setViewModal(true);
killedBy: InstructorInstructorCoursesIndexPage tests Can submit new course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/pages/Courses/InstructorCoursesIndexPage.jsx:51:24
     mutation.mutate(data);
   };
 
-  const createCourse = () => setViewModal(true);
+  const createCourse = () => undefined;
 
   return (
killedBy: InstructorInstructorCoursesIndexPage tests Can submit new course
statusReason: Unable to find a label with the text of: Course Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Killed] BooleanLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:51:43
     mutation.mutate(data);
   };
 
-  const createCourse = () => setViewModal(true);
+  const createCourse = () => setViewModal(false);
 
   return (
killedBy: InstructorInstructorCoursesIndexPage tests Can submit new course
statusReason: Unable to find a label with the text of: Course Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Survived] BooleanLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:72:35
         <InstructorAdminCoursesTable
           courses={courses}
           currentUser={currentUser}
-          enableInstructorUpdate={false}
+          enableInstructorUpdate={true}
           deleteCourseButton={true}
         />

[Killed] BooleanLiteral
main/pages/Courses/InstructorCoursesIndexPage.jsx:73:31
           courses={courses}
           currentUser={currentUser}
           enableInstructorUpdate={false}
-          deleteCourseButton={true}
+          deleteCourseButton={false}
         />
       </div>
killedBy: InstructorInstructorCoursesIndexPage tests Delete column does appear when deleteCourseButton is true
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-header-delete-sort-header"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
