[Killed] ArrayDeclaration
main/pages/Home/HomePageLoggedIn.jsx:20:5
     error: _staffError,
     status: _staffStatus,
   } = useBackend(
-    ["/api/courses/list/staff"],
+    [],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET.
     { method: "GET", url: "/api/courses/list/staff" },
killedBy: HomePageLoggedIn tests useBackend and useBackendMutation are called with correct cache query key
statusReason: expected 1st "useBackend" call to have been called with [ [ '/api/courses/list/staff' ], …(2) ]

[Killed] ArrayDeclaration
main/pages/Home/HomePageLoggedIn.jsx:31:5
     error: _instructorError,
     status: _instructorStatus,
   } = useBackend(
-    ["/api/courses/list/instructors"],
+    [],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
     { method: "GET", url: "/api/courses/list/instructors" },
killedBy: HomePageLoggedIn tests Can submit new course
statusReason: expected undefined to be truthy

[Killed] BooleanLiteral
main/pages/Home/HomePageLoggedIn.jsx:36:5
     { method: "GET", url: "/api/courses/list/instructors" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
-    false,
+    true,
     {
       enabled: Boolean(hasRole(currentUser, "ROLE_INSTRUCTOR")),
killedBy: HomePageLoggedIn tests toast called on instructor error
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:38:45
     [],
     false,
     {
-      enabled: Boolean(hasRole(currentUser, "ROLE_INSTRUCTOR")),
+      enabled: Boolean(hasRole(currentUser, "")),
     },
   );
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Killed] ObjectLiteral
main/pages/Home/HomePageLoggedIn.jsx:47:13
   const objectToAxiosParams = (course) => ({
     url: "/api/courses/post",
     method: "POST",
-    params: {
-      courseName: course.courseName,
-      term: course.term,
-      school: course.school,
-    },
+    params: {},
   });
 
killedBy: HomePageLoggedIn tests Can submit new course
statusReason: expected {} to deeply equal { courseName: 'CMPSC 5A', …(2) }

[Killed] ObjectLiteral
main/pages/Home/HomePageLoggedIn.jsx:59:60
     setViewModal(false);
   };
 
-  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
+  const mutation = useBackendMutation(objectToAxiosParams, {}, [
     "/api/courses/list/instructors",
   ]);
killedBy: HomePageLoggedIn tests Can submit new course
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="CourseModal-base"
>
  <div
    class="modal-content"

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:82:31
             />
             <Button
               onClick={createCourse}
-              style={{ float: "right", marginBottom: 10 }}
+              style={{ float: "", marginBottom: 10 }}
               variant="primary"
             >
killedBy: HomePageLoggedIn tests Can submit new course
statusReason: expect(element).toHaveStyle()

- Expected

- float: right;
  margin-bottom: 10px;

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:88:14
               Create Course
             </Button>
             <h1>Your Instructor Courses</h1>
-            {instructorCourses.length === 0 && (
-              <p>
-                No instructor courses yet. Click the button above to create one.
-              </p>
-            )}
+            {true}
             {instructorCourses.length > 0 && (
               <>
killedBy: HomePageLoggedIn tests table doesn't render for instructors when courses don't exist
statusReason: Unable to find an element with the text: No instructor courses yet. Click the button above to create one.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction:

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:88:14
               Create Course
             </Button>
             <h1>Your Instructor Courses</h1>
-            {instructorCourses.length === 0 && (
+            {true && (
               <p>
                 No instructor courses yet. Click the button above to create one.
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No instructor courses yet. Click the button above to create one.
</p> instead

[Killed] EqualityOperator
main/pages/Home/HomePageLoggedIn.jsx:93:14
                 No instructor courses yet. Click the button above to create one.
               </p>
             )}
-            {instructorCourses.length > 0 && (
+            {instructorCourses.length >= 0 && (
               <>
                 <InstructorAdminCoursesTable
killedBy: HomePageLoggedIn tests table doesn't render for instructors when courses don't exist
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <table
  class="table table-striped table-bordered"
  data-testid="InstructorAdminCoursesTable"
>
  <thead>
    <tr

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:93:14
                 No instructor courses yet. Click the button above to create one.
               </p>
             )}
-            {instructorCourses.length > 0 && (
-              <>
-                <InstructorAdminCoursesTable
-                  courses={instructorCourses}
-                  currentUser={currentUser}
-                />
-              </>
-            )}
+            {instructorCourses.length > 0 || <>
+                <InstructorAdminCoursesTable courses={instructorCourses} currentUser={currentUser} />
+              </>}
           </>
         )}
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:106:10
         <h1>Your Student Courses</h1>
         <StudentCoursesTable testid={"CoursesTable"} />
         <h1>Your Staff Courses</h1>
-        {staffCourses.length === 0 && <p>No staff courses yet.</p>}
+        {true}
         {staffCourses.length > 0 && (
           <InstructorAdminCoursesTable
killedBy: HomePageLoggedIn tests staff courses section renders empty message when there are no staffCourses
statusReason: Unable to find an element with the text: No staff courses yet.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:106:10
         <h1>Your Student Courses</h1>
         <StudentCoursesTable testid={"CoursesTable"} />
         <h1>Your Staff Courses</h1>
-        {staffCourses.length === 0 && <p>No staff courses yet.</p>}
+        {true && <p>No staff courses yet.</p>}
         {staffCourses.length > 0 && (
           <InstructorAdminCoursesTable
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No staff courses yet.
</p> instead

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:107:10
         <StudentCoursesTable testid={"CoursesTable"} />
         <h1>Your Staff Courses</h1>
         {staffCourses.length === 0 && <p>No staff courses yet.</p>}
-        {staffCourses.length > 0 && (
-          <InstructorAdminCoursesTable
-            courses={staffCourses}
-            currentUser={currentUser}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Killed] EqualityOperator
main/pages/Home/HomePageLoggedIn.jsx:107:10
         <StudentCoursesTable testid={"CoursesTable"} />
         <h1>Your Staff Courses</h1>
         {staffCourses.length === 0 && <p>No staff courses yet.</p>}
-        {staffCourses.length > 0 && (
+        {staffCourses.length >= 0 && (
           <InstructorAdminCoursesTable
             courses={staffCourses}
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: Found multiple elements by: [data-testid="InstructorAdminCoursesTable"]

Here are the matching elements:

Ignored nodes: comments, script, style
<table
  class="table table-striped table-bordered"
  data-testid="InstructorAdminCoursesTable"
