[Killed] ArrayDeclaration
main/components/Courses/CoursesTable.jsx:6:21
 import { Link } from "react-router";
 import LinkToScaffold from "./LinkToScaffold";
 
-const baseColumns = [
-  {
-    header: "id",
-    accessorKey: "id", // accessor is the "key" in the data
-  },
-  {
-    header: "Course Name",
-    accessorKey: "courseName",
-  },
-  {
-    header: "Term",
-    accessorKey: "term",
-  },
-  {
-    header: "School",
-    id: "school",
-    accessorKey: "school.displayName",
-  },
-];
+const baseColumns = [];
 
 export default function CoursesTable({
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.jsx:7:3
 import LinkToScaffold from "./LinkToScaffold";
 
 const baseColumns = [
-  {
-    header: "id",
-    accessorKey: "id", // accessor is the "key" in the data
-  },
+  {},
   {
     header: "Course Name",
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:16:13
     accessorKey: "courseName",
   },
   {
-    header: "Term",
+    header: "",
     accessorKey: "term",
   },
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Term. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:17:18
   },
   {
     header: "Term",
-    accessorKey: "term",
+    accessorKey: "",
   },
   {
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:31:4
   testId,
   isLoading,
   courseNameLinkPrefix,
-}) {
-  const columns = courseNameLinkPrefix
-    ? baseColumns.map((column) =>
-        column.accessorKey === "courseName"
-          ? {
-              ...column,
-              id: "courseName",
-              cell: ({ cell }) => (
-                <LinkToScaffold
-                  courseName={cell.row.original.courseName}
-                  courseId={cell.row.original.id}
-                  rowIndex={cell.row.index}
-                  testId={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-                />
-              ),
-            }
-          : column,
-      )
-    : baseColumns;
-
-  return <OurTable data={courses} columns={columns} testid={testId} />;
-}
+}) {}
 
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Courses/CoursesTable.jsx:33:23
   courseNameLinkPrefix,
 }) {
   const columns = courseNameLinkPrefix
-    ? baseColumns.map((column) =>
-        column.accessorKey === "courseName"
-          ? {
-              ...column,
-              id: "courseName",
-              cell: ({ cell }) => (
-                <LinkToScaffold
-                  courseName={cell.row.original.courseName}
-                  courseId={cell.row.original.id}
-                  rowIndex={cell.row.index}
-                  testId={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-                />
-              ),
-            }
-          : column,
+    ? baseColumns.map(() => undefined,
       )
     : baseColumns;
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Unable to find an element by: [data-testid="InstructorAdminCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:34:9
 }) {
   const columns = courseNameLinkPrefix
     ? baseColumns.map((column) =>
-        column.accessorKey === "courseName"
+        false
           ? {
               ...column,
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:34:9
 }) {
   const columns = courseNameLinkPrefix
     ? baseColumns.map((column) =>
-        column.accessorKey === "courseName"
+        true
           ? {
               ...column,
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ArrowFunction
main/components/Courses/CoursesTable.jsx:38:21
           ? {
               ...column,
               id: "courseName",
-              cell: ({ cell }) => (
-                <LinkToScaffold
-                  courseName={cell.row.original.courseName}
-                  courseId={cell.row.original.id}
-                  rowIndex={cell.row.index}
-                  testId={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-                />
-              ),
+              cell: () => undefined,
             }
           : column,
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 8
Received:

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:43:27
                   courseName={cell.row.original.courseName}
                   courseId={cell.row.original.id}
                   rowIndex={cell.row.index}
-                  testId={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
+                  testId={``}
                 />
               ),
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"
