[Survived] BooleanLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:7:29
 import EdgeTable from "main/components/Concept/EdgeTable";
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 
-const suppressFetchToasts = true;
+const suppressFetchToasts = false;
 
 export default function EdgeConceptTabComponent({ courseId, testIdPrefix }) {

[Killed] StringLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:14:24
   const [targetConceptId, setTargetConceptId] = useState("");
   const [createEdgeError, setCreateEdgeError] = useState(null);
 
-  const conceptsPath = `/api/concepts/course?courseId=${courseId}`;
+  const conceptsPath = ``;
   const { data: concepts } = useBackend(
     [conceptsPath],
killedBy: EdgeConceptTabComponent tests renders fetched edges with concept labels
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Variables
Received:
  id 1

Ignored nodes: comments, script, style

[Survived] StringLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:17:15
   const conceptsPath = `/api/concepts/course?courseId=${courseId}`;
   const { data: concepts } = useBackend(
     [conceptsPath],
-    { method: "GET", url: conceptsPath },
+    { method: "", url: conceptsPath },
     [],
     suppressFetchToasts,

[Survived] ArrayDeclaration
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:18:5
   const { data: concepts } = useBackend(
     [conceptsPath],
     { method: "GET", url: conceptsPath },
-    [],
+    ["Stryker was here"],
     suppressFetchToasts,
   );

[Survived] StringLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:25:15
   const edgesPath = `/api/concepts/edges?courseId=${courseId}`;
   const { data: edges } = useBackend(
     [edgesPath],
-    { method: "GET", url: edgesPath },
+    { method: "", url: edgesPath },
     [],
     suppressFetchToasts,

[Killed] ArrowFunction
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:31:18
   );
 
   const labelById = new Map(
-    concepts.map((concept) => [concept.id, concept.label]),
+    concepts.map(() => undefined),
   );
 
killedBy: EdgeConceptTabComponent tests renders fetched edges with concept labels
statusReason: Unable to find an element by: [data-testid="test-EdgeTable-cell-row-0-col-sourceLabel"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrayDeclaration
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:31:31
   );
 
   const labelById = new Map(
-    concepts.map((concept) => [concept.id, concept.label]),
+    concepts.map((concept) => []),
   );
 
killedBy: EdgeConceptTabComponent tests renders fetched edges with concept labels
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Variables
Received:
  id 1

Ignored nodes: comments, script, style

[Killed] ArrowFunction
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:34:37
     concepts.map((concept) => [concept.id, concept.label]),
   );
 
-  const edgesWithLabels = edges.map((edge) => ({
-    ...edge,
-    sourceLabel: labelById.get(edge.sourceId) ?? `id ${edge.sourceId}`,
-    targetLabel: labelById.get(edge.targetId) ?? `id ${edge.targetId}`,
-  }));
+  const edgesWithLabels = edges.map(() => undefined);
 
   const createEdgeObjectToAxiosParams = ({
killedBy: EdgeConceptTabComponent tests renders fetched edges with concept labels
statusReason: Unable to find an element by: [data-testid="test-EdgeTable-cell-row-0-col-sourceLabel"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:36:18
 
   const edgesWithLabels = edges.map((edge) => ({
     ...edge,
-    sourceLabel: labelById.get(edge.sourceId) ?? `id ${edge.sourceId}`,
+    sourceLabel: labelById.get(edge.sourceId) && `id ${edge.sourceId}`,
     targetLabel: labelById.get(edge.targetId) ?? `id ${edge.targetId}`,
   }));
killedBy: EdgeConceptTabComponent tests renders fetched edges with concept labels
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Variables
Received:
  id 1

Ignored nodes: comments, script, style

[Killed] LogicalOperator
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:37:18
   const edgesWithLabels = edges.map((edge) => ({
     ...edge,
     sourceLabel: labelById.get(edge.sourceId) ?? `id ${edge.sourceId}`,
-    targetLabel: labelById.get(edge.targetId) ?? `id ${edge.targetId}`,
+    targetLabel: labelById.get(edge.targetId) && `id ${edge.targetId}`,
   }));
 
killedBy: EdgeConceptTabComponent tests renders fetched edges with concept labels
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Loops
Received:
  id 2

[Killed] StringLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:37:50
   const edgesWithLabels = edges.map((edge) => ({
     ...edge,
     sourceLabel: labelById.get(edge.sourceId) ?? `id ${edge.sourceId}`,
-    targetLabel: labelById.get(edge.targetId) ?? `id ${edge.targetId}`,
+    targetLabel: labelById.get(edge.targetId) ?? ``,
   }));
 
killedBy: EdgeConceptTabComponent tests falls back to id when a concept label is unknown
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  id 999
Received:


Ignored nodes: comments, script, style

[Killed] ArrowFunction
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:40:41
     targetLabel: labelById.get(edge.targetId) ?? `id ${edge.targetId}`,
   }));
 
-  const createEdgeObjectToAxiosParams = ({
-    sourceConceptId,
-    targetConceptId,
-  }) => ({
-    url: "/api/concepts/edges/post",
-    method: "POST",
-    params: { sourceConceptId, targetConceptId },
-  });
+  const createEdgeObjectToAxiosParams = () => undefined;
 
   const createEdgeMutation = useBackendMutation(
killedBy: EdgeConceptTabComponent tests submits a new edge with the selected concepts
statusReason: expected "vi.fn()" to be called with arguments: [ { sourceConceptId: '1', …(1) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:43:10
   const createEdgeObjectToAxiosParams = ({
     sourceConceptId,
     targetConceptId,
-  }) => ({
-    url: "/api/concepts/edges/post",
-    method: "POST",
-    params: { sourceConceptId, targetConceptId },
-  });
+  }) => ({});
 
   const createEdgeMutation = useBackendMutation(
killedBy: EdgeConceptTabComponent tests submits a new edge with the selected concepts
statusReason: expected "vi.fn()" to be called with arguments: [ { sourceConceptId: '1', …(1) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:52:24
   const createEdgeMutation = useBackendMutation(
     createEdgeObjectToAxiosParams,
     {
-      onSuccess: () => {
-        toast("Edge created");
-        setSourceConceptId("");
-        setTargetConceptId("");
-      },
+      onSuccess: () => {},
       onError: (error) => {
         const message =
killedBy: EdgeConceptTabComponent tests submits a new edge with the selected concepts
statusReason: expected "vi.fn()" to be called with arguments: [ 'Edge created' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] StringLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:55:28
       onSuccess: () => {
         toast("Edge created");
         setSourceConceptId("");
-        setTargetConceptId("");
+        setTargetConceptId("Stryker was here!");
       },
       onError: (error) => {

[Killed] BlockStatement
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:57:27
         setSourceConceptId("");
         setTargetConceptId("");
       },
-      onError: (error) => {
-        const message =
-          error.response?.data?.message ??
-          "Error creating edge; please try again";
-        setCreateEdgeError(message);
-        toast(message);
-      },
+      onError: (error) => {},
     },
     [edgesPath],
killedBy: EdgeConceptTabComponent tests shows backend error message under the selectors when create fails
statusReason: Unable to find an element by: [data-testid="test-create-edge-error"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-edgeConceptTab"

[Killed] LogicalOperator
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:59:11
       },
       onError: (error) => {
         const message =
-          error.response?.data?.message ??
-          "Error creating edge; please try again";
+          error.response?.data?.message && "Error creating edge; please try again";
         setCreateEdgeError(message);
         toast(message);
killedBy: EdgeConceptTabComponent tests shows backend error message under the selectors when create fails
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  edge from concept 1 to concept 2 would create a cycle
Received:
  Error creating edge; please try again

[Survived] OptionalChaining
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:59:11
       },
       onError: (error) => {
         const message =
-          error.response?.data?.message ??
+          error.response?.data.message ??
           "Error creating edge; please try again";
         setCreateEdgeError(message);

[Survived] ArrayDeclaration
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:65:5
         toast(message);
       },
     },
-    [edgesPath],
+    [],
   );
 

[Killed] ArrowFunction
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:68:41
     [edgesPath],
   );
 
-  const deleteEdgeObjectToAxiosParams = (cell) => ({
-    url: "/api/concepts/edges/delete",
-    method: "DELETE",
-    params: { id: cell.row.original.id },
-  });
+  const deleteEdgeObjectToAxiosParams = () => undefined;
 
   const deleteEdgeMutation = useBackendMutation(
killedBy: EdgeConceptTabComponent tests deletes an edge when the Delete button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ { id: '10' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:69:10
   );
 
   const deleteEdgeObjectToAxiosParams = (cell) => ({
-    url: "/api/concepts/edges/delete",
+    url: "",
     method: "DELETE",
     params: { id: cell.row.original.id },
killedBy: EdgeConceptTabComponent tests deletes an edge when the Delete button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ { id: '10' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:77:24
   const deleteEdgeMutation = useBackendMutation(
     deleteEdgeObjectToAxiosParams,
     {
-      onSuccess: () => {
-        toast("Edge deleted");
-      },
+      onSuccess: () => {},
     },
     [edgesPath],
killedBy: EdgeConceptTabComponent tests deletes an edge when the Delete button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'Edge deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:78:15
     deleteEdgeObjectToAxiosParams,
     {
       onSuccess: () => {
-        toast("Edge deleted");
+        toast("");
       },
     },
killedBy: EdgeConceptTabComponent tests deletes an edge when the Delete button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'Edge deleted' ]

Received:

  1st vi.fn() call:

  [
-   "Edge deleted",

[Killed] BlockStatement
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:84:39
     [edgesPath],
   );
 
-  const handleCreateEdge = (event) => {
-    event.preventDefault();
-    setCreateEdgeError(null);
-    createEdgeMutation.mutate({ sourceConceptId, targetConceptId });
-  };
+  const handleCreateEdge = (event) => {};
 
   const createDisabled =
killedBy: EdgeConceptTabComponent tests submits a new edge with the selected concepts
statusReason: expected "vi.fn()" to be called with arguments: [ { sourceConceptId: '1', …(1) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:91:5
   };
 
   const createDisabled =
-    sourceConceptId === "" ||
-    targetConceptId === "" ||
+    sourceConceptId === "" && targetConceptId === "" ||
     sourceConceptId === targetConceptId;
 
killedBy: EdgeConceptTabComponent tests create button is disabled until different from/to concepts are selected
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="test-create-edge-button"
  type="submit"
/>

[Killed] LogicalOperator
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:91:5
   };
 
   const createDisabled =
-    sourceConceptId === "" ||
-    targetConceptId === "" ||
-    sourceConceptId === targetConceptId;
+    (sourceConceptId === "" || targetConceptId === "") && sourceConceptId === targetConceptId;
 
   return (
killedBy: EdgeConceptTabComponent tests create button is disabled until different from/to concepts are selected
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="test-create-edge-button"
  type="submit"
/>

[Killed] EqualityOperator
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:92:5
 
   const createDisabled =
     sourceConceptId === "" ||
-    targetConceptId === "" ||
+    targetConceptId !== "" ||
     sourceConceptId === targetConceptId;
 
killedBy: EdgeConceptTabComponent tests create button is disabled until different from/to concepts are selected
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="test-create-edge-button"
  type="submit"
/>

[Killed] ConditionalExpression
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:92:5
 
   const createDisabled =
     sourceConceptId === "" ||
-    targetConceptId === "" ||
+    false ||
     sourceConceptId === targetConceptId;
 
killedBy: EdgeConceptTabComponent tests create button is disabled until different from/to concepts are selected
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="test-create-edge-button"
  type="submit"
/>

[Killed] ConditionalExpression
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:93:5
   const createDisabled =
     sourceConceptId === "" ||
     targetConceptId === "" ||
-    sourceConceptId === targetConceptId;
+    false;
 
   return (
killedBy: EdgeConceptTabComponent tests create button is disabled until different from/to concepts are selected
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="test-create-edge-button"
  type="submit"
/>

[Killed] EqualityOperator
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:93:5
   const createDisabled =
     sourceConceptId === "" ||
     targetConceptId === "" ||
-    sourceConceptId === targetConceptId;
+    sourceConceptId !== targetConceptId;
 
   return (
killedBy: EdgeConceptTabComponent tests create button is disabled until different from/to concepts are selected
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="test-create-edge-button"
  type="submit"
/>

[Killed] ArrowFunction
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:114:23
             id="sourceConceptId"
             data-testid={`${testIdPrefix}-source-select`}
             value={sourceConceptId}
-            onChange={(event) => setSourceConceptId(event.target.value)}
+            onChange={() => undefined}
           >
             <option value="">Select a concept</option>
killedBy: EdgeConceptTabComponent tests create button is disabled until different from/to concepts are selected
statusReason: expect(element).toBeEnabled()

Received element is not enabled:
  <button
  class="btn btn-primary"
  data-testid="test-create-edge-button"
  disabled=""
  type="submit"

[Killed] ArrowFunction
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:117:27
             onChange={(event) => setSourceConceptId(event.target.value)}
           >
             <option value="">Select a concept</option>
-            {concepts.map((concept) => (
-              <option key={concept.id} value={concept.id}>
-                {concept.label}
-              </option>
-            ))}
+            {concepts.map(() => undefined)}
           </Form.Select>
         </Form.Group>
killedBy: EdgeConceptTabComponent tests populates the source and target dropdowns with concept labels
statusReason: expect(element).toContainHTML()
Expected:
  Variables
Received:
  <select
  class="form-select"
  data-testid="test-source-select"
  id="sourceConceptId"

[Killed] StringLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:128:26
           <Form.Label htmlFor="targetConceptId">To (target)</Form.Label>
           <Form.Select
             id="targetConceptId"
-            data-testid={`${testIdPrefix}-target-select`}
+            data-testid={``}
             value={targetConceptId}
             onChange={(event) => setTargetConceptId(event.target.value)}
killedBy: EdgeConceptTabComponent tests populates the source and target dropdowns with concept labels
statusReason: Unable to find an element by: [data-testid="test-target-select"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-edgeConceptTab"

[Killed] ArrowFunction
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:130:23
             id="targetConceptId"
             data-testid={`${testIdPrefix}-target-select`}
             value={targetConceptId}
-            onChange={(event) => setTargetConceptId(event.target.value)}
+            onChange={() => undefined}
           >
             <option value="">Select a concept</option>
killedBy: EdgeConceptTabComponent tests create button is disabled until different from/to concepts are selected
statusReason: expect(element).toBeEnabled()

Received element is not enabled:
  <button
  class="btn btn-primary"
  data-testid="test-create-edge-button"
  disabled=""
  type="submit"

[Killed] ConditionalExpression
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:140:10
             ))}
           </Form.Select>
         </Form.Group>
-        {createEdgeError && (
-          <Alert
-            variant="danger"
-            data-testid={`${testIdPrefix}-create-edge-error`}
-          >
-            {createEdgeError}
-          </Alert>
-        )}
+        {false}
         <Button
           type="submit"
killedBy: EdgeConceptTabComponent tests shows backend error message under the selectors when create fails
statusReason: Unable to find an element by: [data-testid="test-create-edge-error"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-edgeConceptTab"

[Killed] ConditionalExpression
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:140:10
             ))}
           </Form.Select>
         </Form.Group>
-        {createEdgeError && (
-          <Alert
-            variant="danger"
-            data-testid={`${testIdPrefix}-create-edge-error`}
-          >
-            {createEdgeError}
-          </Alert>
-        )}
+        {true}
         <Button
           type="submit"
killedBy: EdgeConceptTabComponent tests shows backend error message under the selectors when create fails
statusReason: Unable to find an element by: [data-testid="test-create-edge-error"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-edgeConceptTab"

[Killed] BlockStatement
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:158:35
       </Form>
       <EdgeTable
         edges={edgesWithLabels}
-        deleteCallback={(cell) => {
-          setCreateEdgeError(null);
-          deleteEdgeMutation.mutate(cell);
-        }}
+        deleteCallback={(cell) => {}}
         testId={`${testIdPrefix}-EdgeTable`}
       />
killedBy: EdgeConceptTabComponent tests deletes an edge when the Delete button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ { id: '10' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
components/Courses/TabComponent/EdgeConceptTabComponent.jsx:162:17
           setCreateEdgeError(null);
           deleteEdgeMutation.mutate(cell);
         }}
-        testId={`${testIdPrefix}-EdgeTable`}
+        testId={``}
       />
     </div>
killedBy: EdgeConceptTabComponent tests renders fetched edges with concept labels
statusReason: Unable to find an element by: [data-testid="test-EdgeTable-cell-row-0-col-sourceLabel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-edgeConceptTab"
