[Killed] BooleanLiteral
components/Courses/TabComponent/SubConceptTabComponent.jsx:11:46
 
 export default function SubConceptTabComponent({ courseId, testIdPrefix }) {
   const [selectedConcept, setSelectedConcept] = useState(null);
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
 
   const { data: subConcepts = [] } = useBackend(
killedBy: InstructorCourseShowPage tests does not show error modal on initial render
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[NoCoverage] ArrayDeclaration
components/Courses/TabComponent/SubConceptTabComponent.jsx:13:31
   const [selectedConcept, setSelectedConcept] = useState(null);
   const [showModal, setShowModal] = useState(false);
 
-  const { data: subConcepts = [] } = useBackend(
+  const { data: subConcepts = ["Stryker was here"] } = useBackend(
     ["/api/concepts/subconcepts", courseId],
     {

[Survived] ArrowFunction
components/Courses/TabComponent/SubConceptTabComponent.jsx:23:39
     [],
   );
 
-  const createSubconceptAxiosParams = (data) => ({
-    url: "/api/concept/subconcept",
-    method: "POST",
-    data: {
-      courseId: Number(courseId),
-      parentConceptId: Number(data.parentId),
-      label: data.label,
-      description: data.description,
-      example: data.example,
-    },
-  });
+  const createSubconceptAxiosParams = () => undefined;
 
   const createSubconceptMutation = useBackendMutation(

[NoCoverage] StringLiteral
components/Courses/TabComponent/SubConceptTabComponent.jsx:24:10
   );
 
   const createSubconceptAxiosParams = (data) => ({
-    url: "/api/concept/subconcept",
+    url: "",
     method: "POST",
     data: {

[NoCoverage] ObjectLiteral
components/Courses/TabComponent/SubConceptTabComponent.jsx:26:11
   const createSubconceptAxiosParams = (data) => ({
     url: "/api/concept/subconcept",
     method: "POST",
-    data: {
-      courseId: Number(courseId),
-      parentConceptId: Number(data.parentId),
-      label: data.label,
-      description: data.description,
-      example: data.example,
-    },
+    data: {},
   });
 

[NoCoverage] BooleanLiteral
components/Courses/TabComponent/SubConceptTabComponent.jsx:37:37
 
   const createSubconceptMutation = useBackendMutation(
     createSubconceptAxiosParams,
-    { onSuccess: () => setShowModal(false) },
+    { onSuccess: () => setShowModal(true) },
     ["/api/concepts/subconcepts", courseId],
   );

[Survived] ArrowFunction
components/Courses/TabComponent/SubConceptTabComponent.jsx:37:18
 
   const createSubconceptMutation = useBackendMutation(
     createSubconceptAxiosParams,
-    { onSuccess: () => setShowModal(false) },
+    { onSuccess: () => undefined },
     ["/api/concepts/subconcepts", courseId],
   );

[Survived] StringLiteral
components/Courses/TabComponent/SubConceptTabComponent.jsx:38:6
   const createSubconceptMutation = useBackendMutation(
     createSubconceptAxiosParams,
     { onSuccess: () => setShowModal(false) },
-    ["/api/concepts/subconcepts", courseId],
+    ["", courseId],
   );
 

[Killed] StringLiteral
components/Courses/TabComponent/SubConceptTabComponent.jsx:47:17
       <ConceptSelector
         courseId={courseId}
         onSelect={setSelectedConcept}
-        testId={`${testIdPrefix}-conceptSelector`}
+        testId={``}
       />
       <Button
killedBy: SubConceptTabComponent tests renders concept selector
statusReason: Unable to find an element by: [data-testid="test-conceptSelector"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-subConceptTab"

[Killed] ArrowFunction
components/Courses/TabComponent/SubConceptTabComponent.jsx:50:18
         testId={`${testIdPrefix}-conceptSelector`}
       />
       <Button
-        onClick={() => setShowModal(true)}
+        onClick={() => undefined}
         disabled={!selectedConcept}
         data-testid={`${testIdPrefix}-createSubConceptButton`}
killedBy: SubConceptTabComponent tests clicking Create SubConcept button opens the SubConceptModal
statusReason: Unable to find an element by: [data-testid="SubConceptModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-subConceptTab"

[Killed] BooleanLiteral
components/Courses/TabComponent/SubConceptTabComponent.jsx:50:37
         testId={`${testIdPrefix}-conceptSelector`}
       />
       <Button
-        onClick={() => setShowModal(true)}
+        onClick={() => setShowModal(false)}
         disabled={!selectedConcept}
         data-testid={`${testIdPrefix}-createSubConceptButton`}
killedBy: SubConceptTabComponent tests clicking Create SubConcept button opens the SubConceptModal
statusReason: Unable to find an element by: [data-testid="SubConceptModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-subConceptTab"

[Killed] BooleanLiteral
components/Courses/TabComponent/SubConceptTabComponent.jsx:51:19
       />
       <Button
         onClick={() => setShowModal(true)}
-        disabled={!selectedConcept}
+        disabled={selectedConcept}
         data-testid={`${testIdPrefix}-createSubConceptButton`}
         className="mt-2"
killedBy: SubConceptTabComponent tests Create SubConcept button is disabled when no concept is selected
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="mt-2 btn btn-primary"
  data-testid="test-createSubConceptButton"
  type="button"
/>

[Killed] OptionalChaining
components/Courses/TabComponent/SubConceptTabComponent.jsx:62:21
         showModal={showModal}
         toggleShowModal={setShowModal}
         initialContents={{
-          parentId: selectedConcept?.id,
+          parentId: selectedConcept.id,
           parentLabel: selectedConcept?.label,
         }}
killedBy: SubConceptTabComponent tests renders the SubConcepts heading
statusReason: Cannot read properties of null (reading 'id')

[Killed] OptionalChaining
components/Courses/TabComponent/SubConceptTabComponent.jsx:63:24
         toggleShowModal={setShowModal}
         initialContents={{
           parentId: selectedConcept?.id,
-          parentLabel: selectedConcept?.label,
+          parentLabel: selectedConcept.label,
         }}
         onSubmitAction={createSubconceptMutation.mutate}
killedBy: SubConceptTabComponent tests renders the SubConcepts heading
statusReason: Cannot read properties of null (reading 'label')
