[Killed] ConditionalExpression
main/pages/Courses/InstructorCourseShowPage.jsx:47:27
   );
 
   // Stryker disable OptionalChaining -- course?.instructorEmail is more readable than course && course.instructorEmail
-  const getCourseFailed = courseBackendFailureCount > 0;
+  const getCourseFailed = true;
   const canEditCourseOptions =
     hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] BooleanLiteral
main/pages/Courses/InstructorCourseShowPage.jsx:83:8
           </Button>
         </Modal.Footer>
       </Modal>
-      {!course ? (
+      {course ? (
         <div data-testid={`${testId}-loading`}>Course: Loading...</div>
       ) : (
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'orgName')

[Survived] StringLiteral
main/pages/Courses/InstructorCourseShowPage.jsx:107:31
                     <LinkToScaffold
                       courseName={course.courseName}
                       courseId={course.id}
-                      testId={`${testId}-title-linkToScaffold`}
+                      testId={``}
                     />
                   </h1>

[Survived] StringLiteral
main/pages/Courses/InstructorCourseShowPage.jsx:118:35
             </div>
           </div>
 
-          <Tabs defaultActiveKey={"students"}>
+          <Tabs defaultActiveKey={""}>
             <Tab eventKey={"students"} title={"Students"} className="pt-2">
               <EnrollmentTabComponent

[Killed] StringLiteral
main/pages/Courses/InstructorCourseShowPage.jsx:119:28
           </div>
 
           <Tabs defaultActiveKey={"students"}>
-            <Tab eventKey={"students"} title={"Students"} className="pt-2">
+            <Tab eventKey={""} title={"Students"} className="pt-2">
               <EnrollmentTabComponent
                 courseId={courseId}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "students") // element.getAttribute("data-rr-ui-event-key") === "students"

Expected the element to have attribute:
  data-rr-ui-event-key="students"
Received:
  data-rr-ui-event-key=""

[Survived] StringLiteral
main/pages/Courses/InstructorCourseShowPage.jsx:135:28
                 isInstructor={staffTabIsInstructor}
               />
             </Tab>
-            <Tab eventKey={"scaffold"} title={"Scaffold"} className="pt-2">
+            <Tab eventKey={""} title={"Scaffold"} className="pt-2">
               <ScaffoldTabComponent courseId={courseId} testIdPrefix={testId} />
             </Tab>

[Survived] StringLiteral
main/pages/Courses/InstructorCourseShowPage.jsx:135:47
                 isInstructor={staffTabIsInstructor}
               />
             </Tab>
-            <Tab eventKey={"scaffold"} title={"Scaffold"} className="pt-2">
+            <Tab eventKey={"scaffold"} title={""} className="pt-2">
               <ScaffoldTabComponent courseId={courseId} testIdPrefix={testId} />
             </Tab>

[Survived] StringLiteral
main/pages/Courses/InstructorCourseShowPage.jsx:138:47
             <Tab eventKey={"scaffold"} title={"Scaffold"} className="pt-2">
               <ScaffoldTabComponent courseId={courseId} testIdPrefix={testId} />
             </Tab>
-            <Tab eventKey={"concepts"} title={"Concepts"} className="pt-2">
+            <Tab eventKey={"concepts"} title={""} className="pt-2">
               <ConceptTabComponent courseId={courseId} testIdPrefix={testId} />
             </Tab>

[Survived] StringLiteral
main/pages/Courses/InstructorCourseShowPage.jsx:143:22
             </Tab>
             <Tab
               eventKey={"subconcepts"}
-              title={"SubConcepts"}
+              title={""}
               className="pt-2"
             >
