[Survived] BooleanLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:12:29
 
 // Suppress error toasts when the concept list fetch fails (e.g. network error);
 // background fetches should not interrupt the user with toast messages.
-const suppressFetchToasts = true;
+const suppressFetchToasts = false;
 const DEFAULT_NEW_CONCEPT_POSITION = { x: 0, y: 0 };
 

[Killed] BooleanLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:16:58
 const DEFAULT_NEW_CONCEPT_POSITION = { x: 0, y: 0 };
 
 export default function ConceptTabComponent({ courseId, testIdPrefix }) {
-  const [showCreateModal, setShowCreateModal] = useState(false);
+  const [showCreateModal, setShowCreateModal] = useState(true);
   const conceptsPath = `/api/concepts/course?courseId=${courseId}`;
   const { data: concepts } = useBackend(
killedBy: InstructorCourseShowPage tests does not show error modal on initial render
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Survived] ArrayDeclaration
components/Courses/TabComponent/ConceptTabComponent.jsx:19:5
   const [showCreateModal, setShowCreateModal] = useState(false);
   const conceptsPath = `/api/concepts/course?courseId=${courseId}`;
   const { data: concepts } = useBackend(
-    [conceptsPath],
+    [],
     { method: "GET", url: conceptsPath },
     [],

[Killed] ObjectLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:20:5
   const conceptsPath = `/api/concepts/course?courseId=${courseId}`;
   const { data: concepts } = useBackend(
     [conceptsPath],
-    { method: "GET", url: conceptsPath },
+    {},
     [],
     suppressFetchToasts,
killedBy: ConceptTabComponent tests renders fetched concepts and correct data-testid
statusReason: Unable to find an element by: [data-testid="test-ConceptTable-cell-row-0-col-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-conceptTab"

[Killed] ArrowFunction
components/Courses/TabComponent/ConceptTabComponent.jsx:32:31
     reset,
   } = useForm();
 
-  const objectToAxiosParams = (concept) => ({
-    url: "/api/concept",
-    method: "POST",
-    data: {
-      courseId,
-      label: concept.label,
-      description: concept.description,
-      example: concept.example,
-      ...DEFAULT_NEW_CONCEPT_POSITION,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const createConceptMutation = useBackendMutation(
killedBy: ConceptTabComponent tests submits a new concept using the current course id
statusReason: expected "vi.fn()" to be called with arguments: [ { courseId: 7, …(5) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:32:45
     reset,
   } = useForm();
 
-  const objectToAxiosParams = (concept) => ({
-    url: "/api/concept",
-    method: "POST",
-    data: {
-      courseId,
-      label: concept.label,
-      description: concept.description,
-      example: concept.example,
-      ...DEFAULT_NEW_CONCEPT_POSITION,
-    },
-  });
+  const objectToAxiosParams = (concept) => ({});
 
   const createConceptMutation = useBackendMutation(
killedBy: ConceptTabComponent tests submits a new concept using the current course id
statusReason: expected "vi.fn()" to be called with arguments: [ { courseId: 7, …(5) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:46:5
 
   const createConceptMutation = useBackendMutation(
     objectToAxiosParams,
-    {
-      onSuccess: (concept) => {
-        toast(`Concept ${concept.label} created`);
-        setShowCreateModal(false);
-      },
-    },
+    {},
     [conceptsPath],
   );
killedBy: ConceptTabComponent tests submits a new concept using the current course id
statusReason: expected "vi.fn()" to be called with arguments: [ 'Concept Recursion created' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
components/Courses/TabComponent/ConceptTabComponent.jsx:47:31
   const createConceptMutation = useBackendMutation(
     objectToAxiosParams,
     {
-      onSuccess: (concept) => {
-        toast(`Concept ${concept.label} created`);
-        setShowCreateModal(false);
-      },
+      onSuccess: (concept) => {},
     },
     [conceptsPath],
killedBy: ConceptTabComponent tests submits a new concept using the current course id
statusReason: expected "vi.fn()" to be called with arguments: [ 'Concept Recursion created' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:49:28
     {
       onSuccess: (concept) => {
         toast(`Concept ${concept.label} created`);
-        setShowCreateModal(false);
+        setShowCreateModal(true);
       },
     },
killedBy: ConceptTabComponent tests submits a new concept using the current course id
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="ConceptModal-submit"
  type="submit"
>
  Create

[Survived] ArrayDeclaration
components/Courses/TabComponent/ConceptTabComponent.jsx:52:5
         setShowCreateModal(false);
       },
     },
-    [conceptsPath],
+    [],
   );
 

[Killed] BlockStatement
components/Courses/TabComponent/ConceptTabComponent.jsx:55:36
     [conceptsPath],
   );
 
-  const downloadYaml = async () => {
-    try {
-      const response = await axios({
-        url: "/api/concepts/yaml/download",
-        method: "GET",
-        params: { courseId },
-      });
-      const blob = new Blob([response.data], { type: "application/x-yaml" });
-      const url = window.URL.createObjectURL(blob);
-      const link = document.createElement("a");
-      link.href = url;
-      link.setAttribute("download", `concepts-course-${courseId}.yaml`);
-      document.body.appendChild(link);
-      link.click();
-      link.remove();
-      window.URL.revokeObjectURL(url);
-    } catch (error) {
-      toast.error(`Error downloading concepts YAML: ${error.message}`);
-    }
-  };
+  const downloadYaml = async () => {};
 
   const objectToAxiosParamsUpload = (formData) => {
killedBy: ConceptTabComponent tests download button fetches the YAML and saves it as a file
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
components/Courses/TabComponent/ConceptTabComponent.jsx:56:9
   );
 
   const downloadYaml = async () => {
-    try {
-      const response = await axios({
-        url: "/api/concepts/yaml/download",
-        method: "GET",
-        params: { courseId },
-      });
-      const blob = new Blob([response.data], { type: "application/x-yaml" });
-      const url = window.URL.createObjectURL(blob);
-      const link = document.createElement("a");
-      link.href = url;
-      link.setAttribute("download", `concepts-course-${courseId}.yaml`);
-      document.body.appendChild(link);
-      link.click();
-      link.remove();
-      window.URL.revokeObjectURL(url);
-    } catch (error) {
+    try {} catch (error) {
       toast.error(`Error downloading concepts YAML: ${error.message}`);
     }
killedBy: ConceptTabComponent tests download button fetches the YAML and saves it as a file
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
components/Courses/TabComponent/ConceptTabComponent.jsx:71:21
       link.click();
       link.remove();
       window.URL.revokeObjectURL(url);
-    } catch (error) {
-      toast.error(`Error downloading concepts YAML: ${error.message}`);
-    }
+    } catch (error) {}
   };
 
killedBy: ConceptTabComponent tests download shows an error toast when the request fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
components/Courses/TabComponent/ConceptTabComponent.jsx:76:51
     }
   };
 
-  const objectToAxiosParamsUpload = (formData) => {
-    const file = new FormData();
-    file.append("file", formData.upload[0]);
-    return {
-      url: "/api/concepts/yaml/upload",
-      method: "POST",
-      data: file,
-      params: {
-        courseId,
-      },
-    };
-  };
+  const objectToAxiosParamsUpload = (formData) => {};
 
   const uploadMutation = useBackendMutation(objectToAxiosParamsUpload, {
killedBy: ConceptTabComponent tests upload posts the file and reports what was created
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:81:15
     file.append("file", formData.upload[0]);
     return {
       url: "/api/concepts/yaml/upload",
-      method: "POST",
+      method: "",
       data: file,
       params: {
killedBy: ConceptTabComponent tests upload posts the file and reports what was created
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:89:72
     };
   };
 
-  const uploadMutation = useBackendMutation(objectToAxiosParamsUpload, {
-    onSuccess: (report) => {
-      toast(
-        `Concepts replaced: ${report.conceptsCreated} concepts, ` +
-          `${report.subconceptsCreated} subconcepts, ${report.edgesCreated} edges, ` +
-          `${report.practiceProblemsCreated} practice problems. ` +
-          `Saved scaffold state was cleared for ${report.userStatesCleared} user(s).`,
-      );
-      reset();
-    },
-    onError: (error) => {
-      toast.error(
-        `Error uploading concepts YAML: ${JSON.stringify(error.response.data, null, 2)}`,
-      );
-    },
-  });
+  const uploadMutation = useBackendMutation(objectToAxiosParamsUpload, {});
 
   return (
killedBy: ConceptTabComponent tests upload posts the file and reports what was created
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
components/Courses/TabComponent/ConceptTabComponent.jsx:90:28
   };
 
   const uploadMutation = useBackendMutation(objectToAxiosParamsUpload, {
-    onSuccess: (report) => {
-      toast(
-        `Concepts replaced: ${report.conceptsCreated} concepts, ` +
-          `${report.subconceptsCreated} subconcepts, ${report.edgesCreated} edges, ` +
-          `${report.practiceProblemsCreated} practice problems. ` +
-          `Saved scaffold state was cleared for ${report.userStatesCleared} user(s).`,
-      );
-      reset();
-    },
+    onSuccess: (report) => {},
     onError: (error) => {
       toast.error(
killedBy: ConceptTabComponent tests upload posts the file and reports what was created
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:93:11
     onSuccess: (report) => {
       toast(
         `Concepts replaced: ${report.conceptsCreated} concepts, ` +
-          `${report.subconceptsCreated} subconcepts, ${report.edgesCreated} edges, ` +
+          `` +
           `${report.practiceProblemsCreated} practice problems. ` +
           `Saved scaffold state was cleared for ${report.userStatesCleared} user(s).`,
killedBy: ConceptTabComponent tests upload posts the file and reports what was created
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Concepts replaced: 3 concepts, 2 subconcepts, 1 edges, 4 practice problems. Saved scaffold state was cleared for 17 user(s).",

[Killed] BlockStatement
components/Courses/TabComponent/ConceptTabComponent.jsx:99:25
       );
       reset();
     },
-    onError: (error) => {
-      toast.error(
-        `Error uploading concepts YAML: ${JSON.stringify(error.response.data, null, 2)}`,
-      );
-    },
+    onError: (error) => {},
   });
 
killedBy: ConceptTabComponent tests upload shows the backend's error report when the file is invalid
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:107:48
   });
 
   return (
-    <div className="tabComponent" data-testid={`${testIdPrefix}-conceptTab`}>
+    <div className="tabComponent" data-testid={``}>
       <h2>Concepts</h2>
       <Button
killedBy: ConceptTabComponent tests renders fetched concepts and correct data-testid
statusReason: Unable to find an element by: [data-testid="test-conceptTab"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid=""

[Killed] ArrowFunction
components/Courses/TabComponent/ConceptTabComponent.jsx:110:18
     <div className="tabComponent" data-testid={`${testIdPrefix}-conceptTab`}>
       <h2>Concepts</h2>
       <Button
-        onClick={() => setShowCreateModal(true)}
+        onClick={() => undefined}
         data-testid={`${testIdPrefix}-post-button`}
         className="mb-3"
killedBy: ConceptTabComponent tests submits a new concept using the current course id
statusReason: Unable to find a label with the text of: Label

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-conceptTab"

[Killed] BooleanLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:110:43
     <div className="tabComponent" data-testid={`${testIdPrefix}-conceptTab`}>
       <h2>Concepts</h2>
       <Button
-        onClick={() => setShowCreateModal(true)}
+        onClick={() => setShowCreateModal(false)}
         data-testid={`${testIdPrefix}-post-button`}
         className="mb-3"
killedBy: ConceptTabComponent tests submits a new concept using the current course id
statusReason: Unable to find a label with the text of: Label

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-conceptTab"

[Killed] ArrowFunction
components/Courses/TabComponent/ConceptTabComponent.jsx:119:25
       <ConceptModal
         showModal={showCreateModal}
         toggleShowModal={setShowCreateModal}
-        onSubmitAction={(concept) => createConceptMutation.mutate(concept)}
+        onSubmitAction={() => undefined}
       />
       <ConceptTable
killedBy: ConceptTabComponent tests submits a new concept using the current course id
statusReason: expected "vi.fn()" to be called with arguments: [ { courseId: 7, …(5) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:123:22
       />
       <ConceptTable
         concepts={concepts}
-        showButtons={false}
+        showButtons={true}
         testId={`${testIdPrefix}-ConceptTable`}
       />
killedBy: ConceptTabComponent tests renders fetched concepts and correct data-testid
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="test-ConceptTable-cell-row-0-col-Edit-button"
  type="button"
>
  Edit

[Killed] StringLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:124:17
       <ConceptTable
         concepts={concepts}
         showButtons={false}
-        testId={`${testIdPrefix}-ConceptTable`}
+        testId={``}
       />
       <hr />
killedBy: ConceptTabComponent tests renders fetched concepts and correct data-testid
statusReason: Unable to find an element by: [data-testid="test-ConceptTable-cell-row-0-col-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-conceptTab"

[Killed] StringLiteral
components/Courses/TabComponent/ConceptTabComponent.jsx:149:26
             type="file"
             accept=".yaml,.yml"
             isInvalid={Boolean(errors.upload)}
-            {...register("upload", { required: true })}
+            {...register("", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
killedBy: ConceptTabComponent tests renders fetched concepts and correct data-testid
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
components/Courses/TabComponent/ConceptTabComponent.jsx:152:14
             {...register("upload", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.upload && "Concepts YAML file is required. "}
+            {true}
           </Form.Control.Feedback>
           <Form.Text muted>
killedBy: ConceptTabComponent tests upload requires a file
statusReason: Unable to find an element with the text: Concepts YAML file is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
components/Courses/TabComponent/ConceptTabComponent.jsx:152:14
             {...register("upload", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.upload && "Concepts YAML file is required. "}
+            {false}
           </Form.Control.Feedback>
           <Form.Text muted>
killedBy: ConceptTabComponent tests upload requires a file
statusReason: Unable to find an element with the text: Concepts YAML file is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
