[Killed] BlockStatement
components/Courses/TabComponent/ScaffoldTabComponent.jsx:7:40
 import { useBackendMutation } from "main/utils/useBackend";
 
 export default function ScaffoldTabComponent({ courseId, testIdPrefix }) {
-  const onSuccessScaffoldReset = () => {
-    toast("Scaffold reset successfully completed.");
-  };
+  const onSuccessScaffoldReset = () => {};
 
   const scaffoldResetAxiosParams = () => ({
killedBy: ScaffoldTabComponent tests reset button posts scaffold reset for the course and shows success feedback
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
components/Courses/TabComponent/ScaffoldTabComponent.jsx:11:36
     toast("Scaffold reset successfully completed.");
   };
 
-  const scaffoldResetAxiosParams = () => ({
-    url: "/api/course/scaffold/reset",
-    method: "POST",
-    params: {
-      courseId,
-    },
-  });
+  const scaffoldResetAxiosParams = () => undefined;
 
   const resetScaffoldMutation = useBackendMutation(scaffoldResetAxiosParams, {
killedBy: ScaffoldTabComponent tests reset button posts scaffold reset for the course and shows success feedback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
components/Courses/TabComponent/ScaffoldTabComponent.jsx:28:22
       <h2>Scaffold</h2>
       <Button
         onClick={resetScaffoldMutation.mutate}
-        data-testid={`${testIdPrefix}-reset-button`}
+        data-testid={``}
       >
         Reset Scaffold
killedBy: ScaffoldTabComponent tests renders with correct data-testid
statusReason: Unable to find an element by: [data-testid="test-reset-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="test-scaffoldTab"
