[Killed] BlockStatement
components/Courses/TabComponent/SettingsTabComponent.jsx:12:49
   testIdPrefix,
   canEditCourseOptions,
 }) {
-  const onSuccessCanvasCredentialsAdded = () => {
-    toast("Canvas credentials successfully added.");
-  };
+  const onSuccessCanvasCredentialsAdded = () => {};
 
   const objectToAxiosParamsCanvasToken = (formData) => ({
killedBy: SettingsTabComponent tests Call PUT for Canvas credentials properly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Canvas credentials successfully added.",

[Killed] ObjectLiteral
components/Courses/TabComponent/SettingsTabComponent.jsx:16:57
     toast("Canvas credentials successfully added.");
   };
 
-  const objectToAxiosParamsCanvasToken = (formData) => ({
-    url: `/api/courses/updateCourseCanvasToken`,
-    method: "PUT",
-    params: {
-      courseId: courseId,
-      canvasCourseId: formData.canvasCourseId,
-      canvasApiToken: formData.canvasApiToken,
-    },
-  });
+  const objectToAxiosParamsCanvasToken = (formData) => ({});
 
   const canvasMutation = useBackendMutation(
killedBy: SettingsTabComponent tests Call PUT for Canvas credentials properly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Canvas credentials successfully added.",

[Survived] StringLiteral
components/Courses/TabComponent/SettingsTabComponent.jsx:39:48
   };
 
   return (
-    <div className="tabComponent" data-testid={`${testIdPrefix}-settingsTab`}>
+    <div className="tabComponent" data-testid={``}>
       <div data-testid={`${testIdPrefix}-canvasForm`}>
         <CanvasApiForm submitAction={handleSubmit} courseId={courseId} />

[Killed] StringLiteral
components/Courses/TabComponent/SettingsTabComponent.jsx:40:25
 
   return (
     <div className="tabComponent" data-testid={`${testIdPrefix}-settingsTab`}>
-      <div data-testid={`${testIdPrefix}-canvasForm`}>
+      <div data-testid={``}>
         <CanvasApiForm submitAction={handleSubmit} courseId={courseId} />
       </div>
killedBy: SettingsTabComponent tests Settings tab component renders correctly
statusReason: Unable to find an element by: [data-testid="CanvasApiForm-canvasForm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="CanvasApiForm-settingsTab"
