[Survived] StringLiteral
main/pages/Help/AboutScaffold.jsx:72:34
       <p>
         The initial prototype of Scaffold, with a design and implementation of
         the Concept Graph, was designed and implemented by Kate Larrick as part
-        of her MS project in the{" "}
+        of her MS project in the{""}
         <a href="https://cs.ucsb.edu">Department of Computer Science</a> at the
         University of California, Santa Barbara. She was advised by{" "}
