[Killed] ConditionalExpression
main/components/Courses/StudentCoursesTable.jsx:25:8
 
   return (
     <>
-      {courses.length > 0 ? (
+      {true ? (
         <>
           <CoursesTable
killedBy: StudentCoursesTable tests renders empty message when no courses
statusReason: Unable to find an element with the text: You are not enrolled in any student courses yet.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTab
