[Killed] ArrayDeclaration
main/components/Courses/InstructorCoursesTable.jsx:22:23
   deleteCourseButton = false,
   courseNameLinkPrefix = "/instructor/courses",
   canEditCourse,
-  mutationQueryKeys = [
-    "/api/courses/allForAdmins",
-    "/api/courses/allForInstructors",
-  ],
+  mutationQueryKeys = [],
 }) {
   const location = useLocation();
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Instructor update mutation uses correct cache keys for invalidation
statusReason: expected "invalidateQueries" to be called 2 times, but got 0 times

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:30:38
   const location = useLocation();
 
   const canEdit = (row) => {
-    if (canEditCourse !== undefined) {
-      return typeof canEditCourse === "function"
-        ? canEditCourse(row)
-        : canEditCourse;
-    }
+    if (canEditCourse !== undefined) {}
     if (hasRole(currentUser, "ROLE_ADMIN")) {
       return true;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests supports permission override props
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:150:15
   const cellToAxiosParamsCourseEdit = (formData) => {
     return {
       url: `/api/courses`,
-      method: "PUT",
+      method: "",
       params: {
         courseId: formData.courseId,
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:224:5
 
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
-    {
-      onSuccess: onDeleteSuccess,
-      onError: onDeleteError,
-    },
+    {},
     mutationQueryKeys,
   );
killedBy: InstructorCoursesTable tests InstructorCoursesTable delete course API call tests Successful delete shows toast and closes modal
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course deleted successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
