[Killed] StringLiteral
main/components/Courses/CourseModal.jsx:12:16
   showModal,
   toggleShowModal,
   initialContents,
-  buttonText = "Create",
+  buttonText = "",
   modalTitle = "Create Course",
 }) {
killedBy: CourseModal Tests Can submit successfully
statusReason: Unable to find an element with the text: Create. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ArrayDeclaration
main/components/Courses/CourseModal.jsx:26:6
   // Reset form when initialContents changes (e.g., when editing)
   useEffect(() => {
     reset(initialContents);
-  }, [initialContents, reset]);
+  }, []);
 
   const closeModal = () => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Courses/CourseModal.jsx:37:20
       show={showModal}
       onHide={closeModal}
       centered={true}
-      data-testid={"CourseModal-base"}
+      data-testid={""}
     >
       <Modal.Header>
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Edit course modal opens and closes properly
statusReason: Unable to find an element by: [data-testid="CourseModal-base"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Courses/CourseModal.jsx:45:24
           type="button"
           className="btn-close"
           aria-label="Close"
-          data-testid={"CourseModal-closeButton"}
+          data-testid={""}
           onClick={closeModal}
         ></button>
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Edit course modal opens and closes properly
statusReason: Unable to find an element by: [data-testid="CourseModal-closeButton"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Courses/CourseModal.jsx:54:28
           <Form.Group>
             <Form.Label htmlFor="courseName">Course Name</Form.Label>
             <Form.Control
-              data-testid={"CourseModal-courseName"}
+              data-testid={""}
               id="courseName"
               type="text"
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: Unable to find an element by: [data-testid="CourseModal-courseName"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Courses/CourseModal.jsx:58:28
               id="courseName"
               type="text"
               isInvalid={Boolean(errors.courseName)}
-              {...register("courseName", {
+              {...register("", {
                 required: "Course Name is required.",
               })}
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Edit course modal opens and closes properly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Courses/CourseModal.jsx:59:27
               type="text"
               isInvalid={Boolean(errors.courseName)}
               {...register("courseName", {
-                required: "Course Name is required.",
+                required: "",
               })}
             />
killedBy: CourseModal Tests Validation works correctly
statusReason: Unable to find an element with the text: /Course Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] OptionalChaining
main/components/Courses/CourseModal.jsx:63:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.courseName?.message}
+              {errors.courseName.message}
             </Form.Control.Feedback>
             <Form.Label htmlFor="term">Term</Form.Label>
killedBy: CourseModal Tests Validation works correctly
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Courses/CourseModal.jsx:67:28
             </Form.Control.Feedback>
             <Form.Label htmlFor="term">Term</Form.Label>
             <Form.Control
-              data-testid={"CourseModal-term"}
+              data-testid={""}
               id="term"
               type="text"
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: Unable to find an element by: [data-testid="CourseModal-term"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ObjectLiteral
main/components/Courses/CourseModal.jsx:71:36
               id="term"
               type="text"
               isInvalid={Boolean(errors.term)}
-              {...register("term", {
-                required: "Course Term is required.",
-              })}
+              {...register("term", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: CourseModal Tests Validation works correctly
statusReason: Unable to find an element with the text: /Course Term is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ObjectLiteral
main/components/Courses/CourseModal.jsx:82:22
           <Form.Group>
             <Form.Label htmlFor="school">School</Form.Label>
             <SchoolTypeahead
-              rules={{ required: "School is required." }}
+              rules={{}}
               control={control}
               testid={"CourseModal-school"}
killedBy: CourseModal Tests Validation works correctly
statusReason: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Courses/CourseModal.jsx:84:23
             <SchoolTypeahead
               rules={{ required: "School is required." }}
               control={control}
-              testid={"CourseModal-school"}
+              testid={""}
             />
             <Form.Control.Feedback type="invalid">
killedBy: CourseModal Tests Can submit successfully
statusReason: Unable to find an element by: [data-testid="CourseModal-school"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
