[Killed] ArrayDeclaration
main/components/Courses/SchoolTypeahead.jsx:6:27
 import { Controller } from "react-hook-form";
 
 export function SchoolTypeahead({ control, rules, testid }) {
-  const { data: schools = [] } = useBackend(
+  const { data: schools = ["Stryker was here"] } = useBackend(
     [`/api/systemInfo/schools`],
     {
killedBy: CourseModal Tests Can submit successfully
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ArrayDeclaration
main/components/Courses/SchoolTypeahead.jsx:7:5
 
 export function SchoolTypeahead({ control, rules, testid }) {
   const { data: schools = [] } = useBackend(
-    [`/api/systemInfo/schools`],
+    [],
     {
       method: "GET",
killedBy: SchoolDropdown tests Various useBackend assertions
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/systemInfo/schools' ], …(4) ]

Received:

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] ObjectLiteral
main/components/Courses/SchoolTypeahead.jsx:8:5
 export function SchoolTypeahead({ control, rules, testid }) {
   const { data: schools = [] } = useBackend(
     [`/api/systemInfo/schools`],
-    {
-      method: "GET",
-      url: `/api/systemInfo/schools`,
-    },
+    {},
     undefined,
     true,
killedBy: CourseModal Tests Can submit successfully
statusReason: Unable to find an element with the text: UCSB. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Courses/SchoolTypeahead.jsx:10:12
     [`/api/systemInfo/schools`],
     {
       method: "GET",
-      url: `/api/systemInfo/schools`,
+      url: ``,
     },
     undefined,
killedBy: SchoolDropdown tests SchoolTypeahead basic typing
statusReason: Unable to find an element with the text: UCSB. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Courses/SchoolTypeahead.jsx:14:5
     },
     undefined,
     true,
-    {
-      staleTime: "static",
-    },
+    {},
   );
 
killedBy: SchoolDropdown tests Various useBackend assertions
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/systemInfo/schools' ], …(4) ]

Received:

  1st useBackend call:

@@ -6,9 +6,7 @@
      "method": "GET",

[Killed] BlockStatement
main/components/Courses/SchoolTypeahead.jsx:19:45
     },
   );
 
-  const filterByFields = (option, props) => {
-    const search = props.text.toLowerCase();
-    return (
-      option.displayName.toLowerCase().includes(search) ||
-      option.alternateNames.some((name) => name.toLowerCase().includes(search))
-    );
-  };
+  const filterByFields = (option, props) => {};
   return (
     <Controller
killedBy: SchoolDropdown tests SchoolTypeahead basic typing
statusReason: Unable to find an element with the text: UCSB. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] MethodExpression
main/components/Courses/SchoolTypeahead.jsx:20:20
   );
 
   const filterByFields = (option, props) => {
-    const search = props.text.toLowerCase();
+    const search = props.text.toUpperCase();
     return (
       option.displayName.toLowerCase().includes(search) ||
killedBy: SchoolDropdown tests SchoolTypeahead basic typing
statusReason: Unable to find an element with the text: UCSB. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Courses/SchoolTypeahead.jsx:22:7
   const filterByFields = (option, props) => {
     const search = props.text.toLowerCase();
     return (
-      option.displayName.toLowerCase().includes(search) ||
-      option.alternateNames.some((name) => name.toLowerCase().includes(search))
+      true
     );
   };
killedBy: SchoolDropdown tests SchoolTypeahead displays no matches on no matches
statusReason: Unable to find an element with the text: No matches found.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] MethodExpression
main/components/Courses/SchoolTypeahead.jsx:22:7
   const filterByFields = (option, props) => {
     const search = props.text.toLowerCase();
     return (
-      option.displayName.toLowerCase().includes(search) ||
+      option.displayName.toUpperCase().includes(search) ||
       option.alternateNames.some((name) => name.toLowerCase().includes(search))
     );
killedBy: CourseModal Tests Can submit successfully
statusReason: Unable to find an element with the text: UCSB. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] MethodExpression
main/components/Courses/SchoolTypeahead.jsx:23:44
     const search = props.text.toLowerCase();
     return (
       option.displayName.toLowerCase().includes(search) ||
-      option.alternateNames.some((name) => name.toLowerCase().includes(search))
+      option.alternateNames.some((name) => name.toUpperCase().includes(search))
     );
   };
killedBy: SchoolDropdown tests SchoolTypeahead basic typing
statusReason: Unable to find an element with the text: UCSB. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] MethodExpression
main/components/Courses/SchoolTypeahead.jsx:23:7
     const search = props.text.toLowerCase();
     return (
       option.displayName.toLowerCase().includes(search) ||
-      option.alternateNames.some((name) => name.toLowerCase().includes(search))
+      option.alternateNames.every(name => name.toLowerCase().includes(search))
     );
   };
killedBy: SchoolDropdown tests SchoolTypeahead basic typing
statusReason: Unable to find an element with the text: UCSB. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/Courses/SchoolTypeahead.jsx:31:15
       control={control}
       name="school"
       rules={rules}
-      render={({ field, fieldState }) => (
-        <Typeahead
-          selected={field.value ? [field.value] : []}
-          onChange={(selected) => field.onChange(selected[0] ?? null)}
-          id="school-typeahead"
-          isInvalid={fieldState.invalid}
-          inputProps={{
-            "aria-label": "Choose a school",
-            "data-testid": testid,
-          }}
-          options={schools}
-          labelKey="displayName"
-          filterBy={filterByFields}
-          placeholder="Start typing to select a school..."
-        />
-      )}
+      render={() => undefined}
     />
   );
killedBy: SchoolDropdown tests SchoolTypeahead basic typing
statusReason: Unable to find an element by: [data-testid="school-typeahead"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Courses/SchoolTypeahead.jsx:34:50
       render={({ field, fieldState }) => (
         <Typeahead
           selected={field.value ? [field.value] : []}
-          onChange={(selected) => field.onChange(selected[0] ?? null)}
+          onChange={(selected) => field.onChange(selected[0] && null)}
           id="school-typeahead"
           isInvalid={fieldState.invalid}
killedBy: CourseModal Tests Can submit successfully
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/Courses/SchoolTypeahead.jsx:34:21
       render={({ field, fieldState }) => (
         <Typeahead
           selected={field.value ? [field.value] : []}
-          onChange={(selected) => field.onChange(selected[0] ?? null)}
+          onChange={() => undefined}
           id="school-typeahead"
           isInvalid={fieldState.invalid}
killedBy: SchoolDropdown tests SchoolTypeahead basic typing
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/Courses/SchoolTypeahead.jsx:38:27
           id="school-typeahead"
           isInvalid={fieldState.invalid}
           inputProps={{
-            "aria-label": "Choose a school",
+            "aria-label": "",
             "data-testid": testid,
           }}
killedBy: CourseModal Tests Can submit successfully
statusReason: expect(element).toHaveAttribute("aria-label", "Choose a school") // element.getAttribute("aria-label") === "Choose a school"

Expected the element to have attribute:
  aria-label="Choose a school"
Received:
  aria-label=""
