[Killed] ObjectLiteral
main/components/Courses/UpdateInstructorForm.jsx:30:43
           id="instructorEmail"
           type="email"
           isInvalid={Boolean(errors.instructorEmail)}
-          {...register("instructorEmail", {
-            required: "Instructor email is required.",
-          })}
+          {...register("instructorEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Error message if email is empty
statusReason: Unable to find an element with the text: /Instructor email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Courses/UpdateInstructorForm.jsx:30:24
           id="instructorEmail"
           type="email"
           isInvalid={Boolean(errors.instructorEmail)}
-          {...register("instructorEmail", {
+          {...register("", {
             required: "Instructor email is required.",
           })}
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Opens modal when admin clicks instructor email
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Courses/UpdateInstructorForm.jsx:35:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.instructorEmail?.message}
+          {errors.instructorEmail.message}
         </Form.Control.Feedback>
         <Form.Text className="text-muted">
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Opens modal when admin clicks instructor email
statusReason: Cannot read properties of undefined (reading 'message')
