[Killed] BlockStatement
main/components/Courses/StudentCoursesTable.jsx:5:49
 import CoursesTable from "main/components/Courses/CoursesTable";
 import React from "react";
 
-export function StudentCoursesTable({ testid }) {
-  const { data: courses } = useBackend(
-    ["/api/courses/list"],
-    // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
-    { method: "GET", url: "/api/courses/list" },
-    // Stryker disable next-line all : don't test default value of empty list
-    [],
-  );
-
-  return (
-    <>
-      {courses.length > 0 ? (
-        <>
-          <CoursesTable
-            courses={courses}
-            testId={testid}
-            courseNameLinkPrefix="/student/courses"
-          />
-        </>
-      ) : (
-        <p>You are not enrolled in any student courses yet.</p>
-      )}
-    </>
-  );
-}
+export function StudentCoursesTable({ testid }) {}
 
killedBy: StudentCoursesTable tests renders correctly with courses
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
